// Canonical Ukrainian Settlements Dictionary
export interface SettlementInfo {
  lat: number;
  lng: number;
  region: string;
}

export const UKRAINE_SETTLEMENTS: Record<string, SettlementInfo> = {
  "Снятин": {
    "lat": 48.45,
    "lng": 25.5667,
    "region": "Івано-Франківська"
  },
  "Мошорине": {
    "lat": 48.625832,
    "lng": 32.711788,
    "region": "Кіровоградська"
  },
  "Гребінки": {
    "lat": 49.95346,
    "lng": 30.1763499,
    "region": "Київська"
  },
  "Демидів": {
    "lat": 49.370838,
    "lng": 24.25095,
    "region": "Львівська"
  },
  "Гореничі": {
    "lat": 50.4206,
    "lng": 30.2106,
    "region": "Київська"
  },
  "Ходосівка": {
    "lat": 50.2728,
    "lng": 30.5222,
    "region": "Київська"
  },
  "Шпортьки": {
    "lat": 49.398613,
    "lng": 34.266109,
    "region": "Полтавська"
  },
  "Кам’янське": {
    "lat": 48.5167748,
    "lng": 34.6068797,
    "region": "Дніпропетровська"
  },
  "Ізюм": {
    "lat": 49.1913202,
    "lng": 37.2784093,
    "region": "Харківська"
  },
  "Вараш": {
    "lat": 51.35,
    "lng": 25.85,
    "region": "Рівненська"
  },
  "Буча": {
    "lat": 50.5503127,
    "lng": 30.2106925,
    "region": "Київська"
  },
  "Київ": {
    "lat": 50.4500336,
    "lng": 30.5241361,
    "region": "Київська"
  },
  "Харків": {
    "lat": 49.9923181,
    "lng": 36.2310146,
    "region": "Харківська"
  },
  "Петропавлівське": {
    "lat": 50.3167,
    "lng": 30.8167,
    "region": "Київська"
  },
  "Львів": {
    "lat": 49.841952,
    "lng": 24.0315921,
    "region": "Львівська"
  },
  "Миколаїв": {
    "lat": 46.9758615,
    "lng": 31.9939666,
    "region": "Миколаївська"
  },
  "Власівка": {
    "lat": 49.1161177,
    "lng": 33.2791833,
    "region": "Кіровоградська"
  },
  "Гатне": {
    "lat": 50.3606,
    "lng": 30.3956,
    "region": "Київська"
  },
  "Коломия": {
    "lat": 48.5333,
    "lng": 25.0333,
    "region": "Івано-Франківська"
  },
  "Вікторівка": {
    "lat": 47.164288,
    "lng": 30.955887,
    "region": "Одеська"
  },
  "Кременчук": {
    "lat": 49.0667,
    "lng": 33.4167,
    "region": "Полтавська"
  },
  "Бориспіль": {
    "lat": 50.3512101,
    "lng": 30.95077,
    "region": "Київська"
  },
  "Коровинці": {
    "lat": 50.809021,
    "lng": 33.767509,
    "region": "Сумська"
  },
  "Кривий Ріг": {
    "lat": 47.9102734,
    "lng": 33.3917703,
    "region": "Дніпропетровська"
  },
  "Бакланова Муравійка": {
    "lat": 51.412239,
    "lng": 31.44219,
    "region": "Чернігівська"
  },
  "Павлоград": {
    "lat": 48.5333,
    "lng": 35.8667,
    "region": "Дніпропетровська"
  },
  "Велика Севастянівка": {
    "lat": 48.883211,
    "lng": 29.7795208,
    "region": "Черкаська"
  },
  "Ужгород": {
    "lat": 48.6223731,
    "lng": 22.3022572,
    "region": "Закарпатська"
  },
  "Сокільники": {
    "lat": 49.7833,
    "lng": 23.95,
    "region": "Львівська"
  },
  "Рівне": {
    "lat": 50.6196175,
    "lng": 26.2513165,
    "region": "Рівненська"
  },
  "Запоріжжя": {
    "lat": 47.8507859,
    "lng": 35.1182867,
    "region": "Запорізька"
  },
  "Миргород": {
    "lat": 49.9667,
    "lng": 33.6,
    "region": "Полтавська"
  },
  "Кропивницький": {
    "lat": 48.5105805,
    "lng": 32.2656283,
    "region": "Кіровоградська"
  },
  "Шатерники": {
    "lat": 50.4673728,
    "lng": 26.9350931,
    "region": "Хмельницька"
  },
  "Веренчанка": {
    "lat": 48.54446,
    "lng": 25.7444,
    "region": "Чернівецька"
  },
  "Запитів": {
    "lat": 49.9171887,
    "lng": 24.2004196,
    "region": "Львівська"
  },
  "Чома": {
    "lat": 48.13591,
    "lng": 22.6339,
    "region": "Закарпатська"
  },
  "Літин": {
    "lat": 49.3289764,
    "lng": 28.0740254,
    "region": "Вінницька"
  },
  "Яблуниця": {
    "lat": 48.0276652,
    "lng": 24.9185738,
    "region": "Чернівецька"
  },
  "Ірпінь": {
    "lat": 50.5206777,
    "lng": 30.2448725,
    "region": "Київська"
  },
  "Безлюдівка": {
    "lat": 49.8667,
    "lng": 36.2667,
    "region": "Харківська"
  },
  "Одеса": {
    "lat": 46.4843023,
    "lng": 30.7322878,
    "region": "Одеська"
  },
  "Хотянівка": {
    "lat": 50.6053,
    "lng": 30.5739,
    "region": "Київська"
  },
  "Микуличин": {
    "lat": 48.4,
    "lng": 24.6,
    "region": "Івано-Франківська"
  },
  "Первомайськ": {
    "lat": 48.045745,
    "lng": 30.8475997,
    "region": "Миколаївська"
  },
  "Покотилівка": {
    "lat": 49.9142,
    "lng": 36.1736,
    "region": "Харківська"
  },
  "Ізмаїл": {
    "lat": 45.3495229,
    "lng": 28.8382832,
    "region": "Одеська"
  },
  "Чугуїв": {
    "lat": 49.8333,
    "lng": 36.6833,
    "region": "Харківська"
  },
  "Ворохта": {
    "lat": 48.2833,
    "lng": 24.5667,
    "region": "Івано-Франківська"
  },
  "Бабинці": {
    "lat": 50.642412,
    "lng": 30.0290694,
    "region": "Київська"
  },
  "Ліски": {
    "lat": 46.5517,
    "lng": 30.8142,
    "region": "Одеська"
  },
  "Подільськ": {
    "lat": 47.7425,
    "lng": 29.5339,
    "region": "Одеська"
  },
  "Новоселівка": {
    "lat": 49.07541,
    "lng": 37.69735,
    "region": "Донецька"
  },
  "Яструбинове": {
    "lat": 47.5075276,
    "lng": 31.3948526,
    "region": "Миколаївська"
  },
  "Тарасівка": {
    "lat": 50.3417,
    "lng": 30.3083,
    "region": "Київська"
  },
  "Крюківщина": {
    "lat": 50.3683,
    "lng": 30.3683,
    "region": "Київська"
  },
  "Тиранівка": {
    "lat": 49.500961,
    "lng": 27.09297,
    "region": "Хмельницька"
  },
  "Вишняки": {
    "lat": 49.75811,
    "lng": 33.32016,
    "region": "Полтавська"
  },
  "Гора": {
    "lat": 50.3667,
    "lng": 30.8667,
    "region": "Київська"
  },
  "Конотоп": {
    "lat": 51.2333,
    "lng": 33.2,
    "region": "Сумська"
  },
  "Комунарівка": {
    "lat": 47.761341,
    "lng": 37.791248,
    "region": "Донецька"
  },
  "Прилуки": {
    "lat": 50.6,
    "lng": 32.3833,
    "region": "Чернігівська"
  },
  "Іржавець": {
    "lat": 50.867378,
    "lng": 32.55695,
    "region": "Чернігівська"
  },
  "Шевченкове": {
    "lat": 50.4056,
    "lng": 30.2611,
    "region": "Київська"
  },
  "Гостомель": {
    "lat": 50.5703,
    "lng": 30.2658,
    "region": "Київська"
  },
  "Городня": {
    "lat": 51.8833,
    "lng": 31.6,
    "region": "Чернігівська"
  },
  "Ковель": {
    "lat": 51.2167,
    "lng": 24.7167,
    "region": "Волинська"
  },
  "Черкаси": {
    "lat": 49.4447056,
    "lng": 32.0588085,
    "region": "Черкаська"
  },
  "Любохини": {
    "lat": 51.4778279,
    "lng": 24.2123653,
    "region": "Волинська"
  },
  "Чайківка": {
    "lat": 47.7071,
    "lng": 30.225109,
    "region": "Одеська"
  },
  "Плюти": {
    "lat": 50.1833,
    "lng": 30.7167,
    "region": "Київська"
  },
  "Нове": {
    "lat": 50.0333575,
    "lng": 32.6109383,
    "region": "Полтавська"
  },
  "Нечаївка": {
    "lat": 50.061806,
    "lng": 26.979488,
    "region": "Хмельницька"
  },
  "Єлизаветівка": {
    "lat": 47.8868463,
    "lng": 37.3034198,
    "region": "Донецька"
  },
  "Турбів": {
    "lat": 49.339939,
    "lng": 28.7260729,
    "region": "Вінницька"
  },
  "Обухів": {
    "lat": 50.1101633,
    "lng": 30.6269696,
    "region": "Київська"
  },
  "Чернігів": {
    "lat": 51.494099,
    "lng": 31.294332,
    "region": "Чернігівська"
  },
  "Вересневе": {
    "lat": 50.590839,
    "lng": 26.162682,
    "region": "Рівненська"
  },
  "Зарванці": {
    "lat": 49.2584825,
    "lng": 28.3871024,
    "region": "Вінницька"
  },
  "Оброшине": {
    "lat": 49.7833,
    "lng": 23.8667,
    "region": "Львівська"
  },
  "Курилівка": {
    "lat": 48.57983,
    "lng": 34.60075,
    "region": "Дніпропетровська"
  },
  "Ріп'янка": {
    "lat": 48.9893697,
    "lng": 24.4748834,
    "region": "Івано-Франківська"
  },
  "Стара  Ушиця": {
    "lat": 48.5970533,
    "lng": 27.0742366,
    "region": "Хмельницька"
  },
  "Полтава": {
    "lat": 49.5897423,
    "lng": 34.5507948,
    "region": "Полтавська"
  },
  "Софіївська Борщагівка": {
    "lat": 50.4089,
    "lng": 30.3683,
    "region": "Київська"
  },
  "Гнідин": {
    "lat": 50.3314,
    "lng": 30.7061,
    "region": "Київська"
  },
  "Фастів": {
    "lat": 50.0799307,
    "lng": 29.9162821,
    "region": "Київська"
  },
  "Компаніївка": {
    "lat": 48.2497235,
    "lng": 32.2043672,
    "region": "Кіровоградська"
  },
  "Краматорськ": {
    "lat": 48.7389415,
    "lng": 37.5843812,
    "region": "Донецька"
  },
  "Вишеньки": {
    "lat": 50.3014,
    "lng": 30.7292,
    "region": "Київська"
  },
  "Глухів": {
    "lat": 51.6833,
    "lng": 33.9167,
    "region": "Сумська"
  },
  "Сміла": {
    "lat": 49.2167,
    "lng": 31.8667,
    "region": "Черкаська"
  },
  "Златопіль": {
    "lat": 49.389598,
    "lng": 36.2127498,
    "region": "Харківська"
  },
  "Вінниця": {
    "lat": 49.2320162,
    "lng": 28.467975,
    "region": "Вінницька"
  },
  "Савинці": {
    "lat": 49.08897,
    "lng": 26.77918,
    "region": "Хмельницька"
  },
  "Луцьк": {
    "lat": 50.7450733,
    "lng": 25.320078,
    "region": "Волинська"
  },
  "Брюховичі": {
    "lat": 49.9022,
    "lng": 23.9533,
    "region": "Львівська"
  },
  "Левківка": {
    "lat": 49.792492,
    "lng": 27.563179,
    "region": "Хмельницька"
  },
  "Монастириська": {
    "lat": 49.0908395,
    "lng": 25.1717816,
    "region": "Тернопільська"
  },
  "Дніпро": {
    "lat": 51.5567163,
    "lng": 30.6121981,
    "region": "Чернігівська"
  },
  "Пальче": {
    "lat": 50.7727875,
    "lng": 25.6450333,
    "region": "Волинська"
  },
  "Вільнянськ": {
    "lat": 47.95,
    "lng": 35.4333,
    "region": "Запорізька"
  },
  "Корюківка": {
    "lat": 51.7667,
    "lng": 32.25,
    "region": "Чернігівська"
  },
  "Дунаївці": {
    "lat": 48.8833,
    "lng": 26.85,
    "region": "Хмельницька"
  },
  "Зубра": {
    "lat": 49.7667,
    "lng": 24.05,
    "region": "Львівська"
  },
  "Хуст": {
    "lat": 48.1764917,
    "lng": 23.291166,
    "region": "Закарпатська"
  },
  "Зміїнець": {
    "lat": 50.7677346,
    "lng": 25.2804334,
    "region": "Волинська"
  },
  "Берегове": {
    "lat": 48.2050985,
    "lng": 22.6453246,
    "region": "Закарпатська"
  },
  "Удобне": {
    "lat": 46.375011,
    "lng": 30.04109,
    "region": "Одеська"
  },
  "Струмівка": {
    "lat": 50.7465821,
    "lng": 25.4162093,
    "region": "Волинська"
  },
  "Підгородне": {
    "lat": 48.5756,
    "lng": 35.1053,
    "region": "Дніпропетровська"
  },
  "Винники": {
    "lat": 49.8167,
    "lng": 24.1333,
    "region": "Львівська"
  },
  "Білогородка": {
    "lat": 50.3997,
    "lng": 30.2289,
    "region": "Київська"
  },
  "Галина Лозуватка": {
    "lat": 48.260212,
    "lng": 33.624668,
    "region": "Дніпропетровська"
  },
  "Красилівка": {
    "lat": 50.5167,
    "lng": 30.9167,
    "region": "Київська"
  },
  "Святопетрівське": {
    "lat": 50.3861,
    "lng": 30.3208,
    "region": "Київська"
  },
  "Козин": {
    "lat": 50.2242,
    "lng": 30.6694,
    "region": "Київська"
  },
  "Умань": {
    "lat": 48.75,
    "lng": 30.2167,
    "region": "Черкаська"
  },
  "Абазівка": {
    "lat": 49.605278,
    "lng": 34.354721,
    "region": "Полтавська"
  },
  "Хмельницький": {
    "lat": 49.4196404,
    "lng": 26.9793793,
    "region": "Хмельницька"
  },
  "Воля-Довголуцька": {
    "lat": 49.199524,
    "lng": 23.704227,
    "region": "Львівська"
  },
  "Кропивник": {
    "lat": 49.5856296,
    "lng": 22.7217823,
    "region": "Львівська"
  },
  "Бровари": {
    "lat": 50.5111168,
    "lng": 30.7900482,
    "region": "Київська"
  },
  "Глибока": {
    "lat": 48.0833,
    "lng": 25.9333,
    "region": "Чернівецька"
  },
  "Борислав": {
    "lat": 49.2833,
    "lng": 23.4167,
    "region": "Львівська"
  },
  "Баланівка": {
    "lat": 48.40198,
    "lng": 29.39118,
    "region": "Вінницька"
  },
  "Верхній Ясенів": {
    "lat": 48.1618012,
    "lng": 24.9444217,
    "region": "Івано-Франківська"
  },
  "Верхнячка": {
    "lat": 48.829805,
    "lng": 30.0417049,
    "region": "Черкаська"
  },
  "Зміїв": {
    "lat": 49.7019133,
    "lng": 36.3633323,
    "region": "Харківська"
  },
  "Стара Оржиця": {
    "lat": 50.464027,
    "lng": 31.903301,
    "region": "Київська"
  },
  "Линовиця": {
    "lat": 50.4641,
    "lng": 32.396339,
    "region": "Чернігівська"
  },
  "Васильків": {
    "lat": 50.178137,
    "lng": 30.3175045,
    "region": "Київська"
  },
  "Рогізна": {
    "lat": 48.56472,
    "lng": 26.88286,
    "region": "Хмельницька"
  },
  "Чабани": {
    "lat": 50.3417,
    "lng": 30.4222,
    "region": "Київська"
  },
  "Тарасове": {
    "lat": 50.7598046,
    "lng": 25.2612931,
    "region": "Волинська"
  },
  "Дрогобич": {
    "lat": 49.3513996,
    "lng": 23.5061662,
    "region": "Львівська"
  },
  "Олександрія": {
    "lat": 48.6667,
    "lng": 33.1167,
    "region": "Кіровоградська"
  },
  "Петропавлівська Борщагівка": {
    "lat": 50.4344,
    "lng": 30.3347,
    "region": "Київська"
  },
  "Гвіздава": {
    "lat": 50.027702,
    "lng": 28.574377,
    "region": "Житомирська"
  },
  "Кир'яківка": {
    "lat": 47.05706,
    "lng": 31.8505,
    "region": "Миколаївська"
  },
  "Новогуйвинське": {
    "lat": 50.206917,
    "lng": 28.6918455,
    "region": "Житомирська"
  },
  "Підгірці": {
    "lat": 50.2458,
    "lng": 30.5517,
    "region": "Київська"
  },
  "Лаврів": {
    "lat": 49.39693,
    "lng": 22.8825189,
    "region": "Львівська"
  },
  "Городок": {
    "lat": 49.1667,
    "lng": 26.5833,
    "region": "Хмельницька"
  },
  "Минай": {
    "lat": 48.589088,
    "lng": 22.27718,
    "region": "Закарпатська"
  },
  "Благодатне": {
    "lat": 47.6992867,
    "lng": 37.4193794,
    "region": "Донецька"
  },
  "Чернівці": {
    "lat": 48.2864702,
    "lng": 25.9376532,
    "region": "Чернівецька"
  },
  "Іванковичі": {
    "lat": 50.2736,
    "lng": 30.4361,
    "region": "Київська"
  },
  "Івано-Франківськ": {
    "lat": 48.9224763,
    "lng": 24.710334,
    "region": "Івано-Франківська"
  },
  "Підпечери": {
    "lat": 48.9276474,
    "lng": 24.8065163,
    "region": "Івано-Франківська"
  },
  "Сторожинець": {
    "lat": 48.1667,
    "lng": 25.7167,
    "region": "Чернівецька"
  },
  "Нова Водолага": {
    "lat": 49.7181212,
    "lng": 35.8601594,
    "region": "Харківська"
  },
  "Зимна Вода": {
    "lat": 49.8222,
    "lng": 23.8889,
    "region": "Львівська"
  },
  "Колоденка": {
    "lat": 50.581604,
    "lng": 26.321194,
    "region": "Рівненська"
  },
  "Велика Олександрівка": {
    "lat": 47.3159392,
    "lng": 33.2997671,
    "region": "Херсонська"
  },
  "Бобриця": {
    "lat": 50.3547,
    "lng": 30.1986,
    "region": "Київська"
  },
  "Охтирка": {
    "lat": 50.3167,
    "lng": 34.9,
    "region": "Сумська"
  },
  "Козятин": {
    "lat": 49.7167,
    "lng": 28.8333,
    "region": "Вінницька"
  },
  "Лозувата": {
    "lat": 49.2523489,
    "lng": 28.8356713,
    "region": "Вінницька"
  },
  "Гвоздів": {
    "lat": 48.8976119,
    "lng": 28.6416182,
    "region": "Вінницька"
  },
  "Гайове": {
    "lat": 49.103741,
    "lng": 34.220692,
    "region": "Полтавська"
  },
  "Березівка": {
    "lat": 47.2016391,
    "lng": 30.908595,
    "region": "Одеська"
  },
  "Гурського": {
    "lat": 47.954472,
    "lng": 35.030125,
    "region": "Запорізька"
  },
  "Торфяне": {
    "lat": 48.9986172,
    "lng": 32.1671806,
    "region": "Черкаська"
  },
  "Коростень": {
    "lat": 50.95,
    "lng": 28.65,
    "region": "Житомирська"
  },
  "Жабокрич": {
    "lat": 48.3832397,
    "lng": 29.0006939,
    "region": "Вінницька"
  },
  "Свидівок": {
    "lat": 49.5167,
    "lng": 31.9,
    "region": "Черкаська"
  },
  "Житні Гори": {
    "lat": 49.72961,
    "lng": 30.46475,
    "region": "Київська"
  },
  "Супрунівка": {
    "lat": 49.5790385,
    "lng": 34.4434256,
    "region": "Полтавська"
  },
  "Біла Церква": {
    "lat": 49.7969703,
    "lng": 30.1158069,
    "region": "Київська"
  },
  "Великодолинське": {
    "lat": 46.3444,
    "lng": 30.5647,
    "region": "Одеська"
  },
  "Нові Санжари": {
    "lat": 49.3338321,
    "lng": 34.3148631,
    "region": "Полтавська"
  },
  "Лозова": {
    "lat": 48.8833,
    "lng": 36.3167,
    "region": "Харківська"
  },
  "Малютянка": {
    "lat": 50.290951,
    "lng": 30.27145,
    "region": "Київська"
  },
  "Шепетівка": {
    "lat": 50.1833,
    "lng": 27.0667,
    "region": "Хмельницька"
  },
  "Борсків": {
    "lat": 49.0233426,
    "lng": 28.3842148,
    "region": "Вінницька"
  },
  "Богушівка": {
    "lat": 50.597881,
    "lng": 25.720711,
    "region": "Рівненська"
  },
  "Білозір'я": {
    "lat": 49.2975805,
    "lng": 31.8935819,
    "region": "Черкаська"
  },
  "Тіньки": {
    "lat": 49.189333,
    "lng": 32.6301848,
    "region": "Черкаська"
  },
  "Баранівка": {
    "lat": 50.3,
    "lng": 27.6667,
    "region": "Житомирська"
  },
  "Горенка": {
    "lat": 50.5583,
    "lng": 30.3167,
    "region": "Київська"
  },
  "Верхнє Водяне": {
    "lat": 48.00613,
    "lng": 23.96874,
    "region": "Закарпатська"
  },
  "Овідіополь": {
    "lat": 46.2473734,
    "lng": 30.4448614,
    "region": "Одеська"
  },
  "Розлуч": {
    "lat": 49.2318505,
    "lng": 22.9797527,
    "region": "Львівська"
  },
  "Любопіль": {
    "lat": 46.723785,
    "lng": 31.096901,
    "region": "Одеська"
  },
  "Осещина": {
    "lat": 50.5786,
    "lng": 30.5486,
    "region": "Київська"
  },
  "Богородчани": {
    "lat": 48.8092602,
    "lng": 24.5456201,
    "region": "Івано-Франківська"
  },
  "Нікополь": {
    "lat": 47.5667,
    "lng": 34.4,
    "region": "Дніпропетровська"
  },
  "Затока": {
    "lat": 46.06396,
    "lng": 30.45033,
    "region": "Одеська"
  },
  "Хотів": {
    "lat": 50.3347,
    "lng": 30.4722,
    "region": "Київська"
  },
  "Ровжи": {
    "lat": 50.852619,
    "lng": 30.60173,
    "region": "Київська"
  },
  "Лук'янівка": {
    "lat": 50.4644462,
    "lng": 30.4751496,
    "region": "Київська"
  },
  "Золотоноша": {
    "lat": 49.6667,
    "lng": 32.0333,
    "region": "Черкаська"
  },
  "Рожни": {
    "lat": 50.6694,
    "lng": 30.7336,
    "region": "Київська"
  },
  "Зазим'я": {
    "lat": 50.5683,
    "lng": 30.6792,
    "region": "Київська"
  },
  "Малі Єрківці": {
    "lat": 50.1627277,
    "lng": 31.2545657,
    "region": "Київська"
  },
  "Зарічани": {
    "lat": 50.2312225,
    "lng": 28.648407,
    "region": "Житомирська"
  },
  "Руське Поле": {
    "lat": 48.054199,
    "lng": 23.526541,
    "region": "Закарпатська"
  },
  "Забуччя": {
    "lat": 50.497631,
    "lng": 30.17189,
    "region": "Київська"
  },
  "Люботин": {
    "lat": 49.95,
    "lng": 35.9333,
    "region": "Харківська"
  },
  "Яготин": {
    "lat": 50.25,
    "lng": 31.7833,
    "region": "Київська"
  },
  "Путрівка": {
    "lat": 50.206043,
    "lng": 30.270786,
    "region": "Київська"
  },
  "Іващуки": {
    "lat": 50.2477046,
    "lng": 25.4280712,
    "region": "Рівненська"
  },
  "Селище": {
    "lat": 49.1296694,
    "lng": 28.358008,
    "region": "Вінницька"
  },
  "Хрінники": {
    "lat": 50.4406102,
    "lng": 25.2465815,
    "region": "Рівненська"
  },
  "Фонтанка": {
    "lat": 46.5636,
    "lng": 30.8572,
    "region": "Одеська"
  },
  "Коростишів": {
    "lat": 50.3167,
    "lng": 29.0667,
    "region": "Житомирська"
  },
  "Холодне": {
    "lat": 48.02759,
    "lng": 38.06265,
    "region": "Донецька"
  },
  "Пилиповичі": {
    "lat": 49.9367995,
    "lng": 32.4975123,
    "region": "Полтавська"
  },
  "Дубно": {
    "lat": 50.4167,
    "lng": 25.75,
    "region": "Рівненська"
  },
  "Білин": {
    "lat": 48.1081001,
    "lng": 24.2526599,
    "region": "Закарпатська"
  },
  "Монастирище": {
    "lat": 48.9944069,
    "lng": 29.8007253,
    "region": "Черкаська"
  },
  "Устинівка": {
    "lat": 47.9576049,
    "lng": 32.5361354,
    "region": "Кіровоградська"
  },
  "Мукачево": {
    "lat": 48.4421119,
    "lng": 22.7185408,
    "region": "Закарпатська"
  },
  "Ніжин": {
    "lat": 51.05,
    "lng": 31.8833,
    "region": "Чернігівська"
  },
  "Рясне-Руське": {
    "lat": 49.8741567,
    "lng": 23.900843,
    "region": "Львівська"
  },
  "Високий": {
    "lat": 49.8833,
    "lng": 36.1167,
    "region": "Харківська"
  },
  "Пухівка": {
    "lat": 50.6067,
    "lng": 30.7103,
    "region": "Київська"
  },
  "Острог": {
    "lat": 50.3333,
    "lng": 26.5167,
    "region": "Рівненська"
  },
  "Карнаухівка": {
    "lat": 48.4748748,
    "lng": 34.7384226,
    "region": "Дніпропетровська"
  },
  "Горького": {
    "lat": 48.4140395,
    "lng": 37.8798218,
    "region": "Донецька"
  },
  "Свалява": {
    "lat": 48.5472,
    "lng": 22.9861,
    "region": "Закарпатська"
  },
  "Жашків": {
    "lat": 49.2478012,
    "lng": 30.1066179,
    "region": "Черкаська"
  },
  "Сагунівка": {
    "lat": 49.2881332,
    "lng": 32.3638683,
    "region": "Черкаська"
  },
  "Мужієво": {
    "lat": 48.1802705,
    "lng": 22.7053982,
    "region": "Закарпатська"
  },
  "Малі Мошківці": {
    "lat": 49.9755423,
    "lng": 28.8661641,
    "region": "Житомирська"
  },
  "Луківка": {
    "lat": 51.260654,
    "lng": 25.058575,
    "region": "Волинська"
  },
  "Кам'янець-Подільський": {
    "lat": 48.6833,
    "lng": 26.5833,
    "region": "Хмельницька"
  },
  "Драбівка": {
    "lat": 49.45015,
    "lng": 31.46965,
    "region": "Черкаська"
  },
  "Костопіль": {
    "lat": 50.8833,
    "lng": 26.45,
    "region": "Рівненська"
  },
  "Малодолинське": {
    "lat": 46.3267,
    "lng": 30.6389,
    "region": "Одеська"
  },
  "Будище": {
    "lat": 51.302368,
    "lng": 30.76996,
    "region": "Чернігівська"
  },
  "Стрий": {
    "lat": 49.255875,
    "lng": 23.8530863,
    "region": "Львівська"
  },
  "Городилець": {
    "lat": 51.1671105,
    "lng": 24.6448382,
    "region": "Волинська"
  },
  "Вільшаниця": {
    "lat": 49.982639,
    "lng": 26.27449,
    "region": "Хмельницька"
  },
  "Бориси": {
    "lat": 50.011173,
    "lng": 23.393637,
    "region": "Львівська"
  },
  "Вільшанська Новоселиця": {
    "lat": 49.982639,
    "lng": 30.314711,
    "region": "Київська"
  },
  "Лиса Гора": {
    "lat": 50.3956673,
    "lng": 30.5494203,
    "region": "Київська"
  },
  "Деревач": {
    "lat": 49.667881,
    "lng": 23.999668,
    "region": "Львівська"
  },
  "Дергачі": {
    "lat": 50.1167,
    "lng": 36.1167,
    "region": "Харківська"
  },
  "Мирне": {
    "lat": 47.4242451,
    "lng": 37.7344444,
    "region": "Донецька"
  },
  "Херсон": {
    "lat": 46.6401295,
    "lng": 32.6143922,
    "region": "Херсонська"
  },
  "Нова Українка": {
    "lat": 50.691261,
    "lng": 26.417311,
    "region": "Рівненська"
  },
  "Миронівка": {
    "lat": 49.65,
    "lng": 30.9833,
    "region": "Київська"
  },
  "Баківці": {
    "lat": 49.5411509,
    "lng": 24.3652359,
    "region": "Львівська"
  },
  "Старе": {
    "lat": 50.148376,
    "lng": 31.080122,
    "region": "Київська"
  },
  "Доманівка": {
    "lat": 47.6322253,
    "lng": 30.9892003,
    "region": "Миколаївська"
  },
  "Дудки": {
    "lat": 50.775589,
    "lng": 30.089951,
    "region": "Київська"
  },
  "Вимушів": {
    "lat": 48.650211,
    "lng": 25.649639,
    "region": "Чернівецька"
  },
  "Лютіж": {
    "lat": 50.6864,
    "lng": 30.3953,
    "region": "Київська"
  },
  "Борщів": {
    "lat": 48.8,
    "lng": 26.0333,
    "region": "Тернопільська"
  },
  "Раковець": {
    "lat": 49.6526137,
    "lng": 24.0214652,
    "region": "Львівська"
  },
  "Бершадь": {
    "lat": 48.3667,
    "lng": 29.5333,
    "region": "Вінницька"
  },
  "Переможинці": {
    "lat": 49.3559796,
    "lng": 31.1834305,
    "region": "Черкаська"
  },
  "Крихівці": {
    "lat": 48.898571,
    "lng": 24.6639,
    "region": "Івано-Франківська"
  },
  "Звягель": {
    "lat": 50.5833,
    "lng": 27.6333,
    "region": "Житомирська"
  },
  "Багачеве": {
    "lat": 49.0167,
    "lng": 31.0667,
    "region": "Черкаська"
  },
  "Шпитьки": {
    "lat": 50.414543,
    "lng": 30.119579,
    "region": "Київська"
  },
  "Калинівка": {
    "lat": 49.45,
    "lng": 28.5167,
    "region": "Вінницька"
  },
  "Бердичів": {
    "lat": 49.9,
    "lng": 28.6,
    "region": "Житомирська"
  },
  "Загвіздя": {
    "lat": 48.92363,
    "lng": 24.665743,
    "region": "Івано-Франківська"
  },
  "Коржівка": {
    "lat": 49.65134,
    "lng": 30.08469,
    "region": "Київська"
  },
  "Корчин": {
    "lat": 50.882149,
    "lng": 26.196211,
    "region": "Рівненська"
  },
  "Новоолександрівка": {
    "lat": 48.35,
    "lng": 35,
    "region": "Дніпропетровська"
  },
  "Костянтинівка": {
    "lat": 48.5348985,
    "lng": 37.6923755,
    "region": "Донецька"
  },
  "Волиця": {
    "lat": 50.24062,
    "lng": 23.838648,
    "region": "Львівська"
  },
  "Цуцилів": {
    "lat": 48.7333849,
    "lng": 24.6461019,
    "region": "Івано-Франківська"
  },
  "Митниця": {
    "lat": 50.280991,
    "lng": 25.127451,
    "region": "Львівська"
  },
  "Грибівка": {
    "lat": 46.2085082,
    "lng": 30.5645436,
    "region": "Одеська"
  },
  "Лубни": {
    "lat": 50.0167,
    "lng": 33,
    "region": "Полтавська"
  },
  "Жовті  Води": {
    "lat": 48.3465174,
    "lng": 33.5027797,
    "region": "Дніпропетровська"
  },
  "Нестоїта": {
    "lat": 47.763401,
    "lng": 29.349979,
    "region": "Одеська"
  },
  "Синельникове": {
    "lat": 48.3167,
    "lng": 35.5167,
    "region": "Дніпропетровська"
  },
  "Суми": {
    "lat": 50.9119775,
    "lng": 34.8027723,
    "region": "Сумська"
  },
  "Зборів": {
    "lat": 49.6645222,
    "lng": 25.1386197,
    "region": "Тернопільська"
  },
  "Пісківка": {
    "lat": 50.6968561,
    "lng": 29.5931036,
    "region": "Київська"
  },
  "Первомайське": {
    "lat": 47.99446,
    "lng": 38.77693,
    "region": "Донецька"
  },
  "Старі Петрівці": {
    "lat": 50.6558,
    "lng": 30.4069,
    "region": "Київська"
  },
  "Здвижівка": {
    "lat": 50.673409,
    "lng": 30.06958,
    "region": "Київська"
  },
  "Чорний Ліс": {
    "lat": 49.7162838,
    "lng": 25.7563056,
    "region": "Тернопільська"
  },
  "Березань": {
    "lat": 50.3132713,
    "lng": 31.4689158,
    "region": "Київська"
  },
  "Кіцмань": {
    "lat": 48.4333,
    "lng": 25.7667,
    "region": "Чернівецька"
  },
  "Хацьки": {
    "lat": 49.301346,
    "lng": 31.952646,
    "region": "Черкаська"
  },
  "Три Копці": {
    "lat": 50.784302,
    "lng": 26.42178,
    "region": "Рівненська"
  },
  "Скала-Подільська": {
    "lat": 48.846608,
    "lng": 26.2016053,
    "region": "Тернопільська"
  },
  "Вознесенськ": {
    "lat": 47.5679582,
    "lng": 31.3338636,
    "region": "Миколаївська"
  },
  "Бірки": {
    "lat": 50.107948,
    "lng": 23.741461,
    "region": "Львівська"
  },
  "Рокитне": {
    "lat": 49.6833,
    "lng": 30.4833,
    "region": "Київська"
  },
  "Димер": {
    "lat": 50.7864057,
    "lng": 30.3038532,
    "region": "Київська"
  },
  "Слобожанське": {
    "lat": 48.5333,
    "lng": 35.0833,
    "region": "Дніпропетровська"
  },
  "Миколаївка": {
    "lat": 48.8610868,
    "lng": 37.7619191,
    "region": "Донецька"
  },
  "Веселинівка": {
    "lat": 47.341461,
    "lng": 30.73597,
    "region": "Одеська"
  },
  "Куча": {
    "lat": 48.761101,
    "lng": 27.25914,
    "region": "Хмельницька"
  },
  "Олександрівка": {
    "lat": 48.7073967,
    "lng": 36.9207752,
    "region": "Донецька"
  },
  "Кароліно-Бугаз": {
    "lat": 46.1458339,
    "lng": 30.5255473,
    "region": "Одеська"
  },
  "Ромни": {
    "lat": 50.75,
    "lng": 33.4833,
    "region": "Сумська"
  },
  "Стави": {
    "lat": 49.855762,
    "lng": 30.673775,
    "region": "Київська"
  },
  "Рославичі": {
    "lat": 50.243832,
    "lng": 30.437452,
    "region": "Київська"
  },
  "Зідьки": {
    "lat": 49.6915,
    "lng": 36.41384,
    "region": "Харківська"
  },
  "Вовчинець": {
    "lat": 48.168179,
    "lng": 25.444679,
    "region": "Чернівецька"
  },
  "Яцьки": {
    "lat": 50.0039433,
    "lng": 30.4283985,
    "region": "Київська"
  },
  "Плоске": {
    "lat": 50.4219269,
    "lng": 26.3872948,
    "region": "Рівненська"
  },
  "Слобода": {
    "lat": 50.7534292,
    "lng": 34.3834838,
    "region": "Сумська"
  },
  "Нові Петрівці": {
    "lat": 50.6225,
    "lng": 30.4464,
    "region": "Київська"
  },
  "Малий Бузуків": {
    "lat": 49.292561,
    "lng": 32.020679,
    "region": "Черкаська"
  },
  "Нижча Дубечня": {
    "lat": 50.6799313,
    "lng": 30.6273995,
    "region": "Київська"
  },
  "Ворзель": {
    "lat": 50.5517,
    "lng": 30.1444,
    "region": "Київська"
  },
  "Городище-Пустоварівське": {
    "lat": 49.64378,
    "lng": 29.939461,
    "region": "Київська"
  },
  "Мачухи": {
    "lat": 49.520832,
    "lng": 34.427502,
    "region": "Полтавська"
  },
  "Поляна": {
    "lat": 48.5833,
    "lng": 22.9667,
    "region": "Закарпатська"
  },
  "Сторожниця": {
    "lat": 48.603851,
    "lng": 22.245966,
    "region": "Закарпатська"
  },
  "Малечковичі": {
    "lat": 49.754341,
    "lng": 23.947384,
    "region": "Львівська"
  },
  "Сушки": {
    "lat": 50.8061047,
    "lng": 28.2405238,
    "region": "Житомирська"
  },
  "Оріховиця": {
    "lat": 48.652367,
    "lng": 22.395945,
    "region": "Закарпатська"
  },
  "Олива": {
    "lat": 44.4130497,
    "lng": 33.8671923,
    "region": "Київська"
  },
  "Ганнусівка": {
    "lat": 49.00589,
    "lng": 24.807131,
    "region": "Івано-Франківська"
  },
  "Топилище": {
    "lat": 50.61676,
    "lng": 24.599079,
    "region": "Волинська"
  },
  "Горошівці": {
    "lat": 48.4784821,
    "lng": 25.9801068,
    "region": "Чернівецька"
  },
  "Перечин": {
    "lat": 48.7369,
    "lng": 22.4739,
    "region": "Закарпатська"
  },
  "Солонка": {
    "lat": 49.7333,
    "lng": 24.0167,
    "region": "Львівська"
  },
  "Грушка": {
    "lat": 48.630981,
    "lng": 27.01675,
    "region": "Хмельницька"
  },
  "Геронимівка": {
    "lat": 49.4500421,
    "lng": 31.9519527,
    "region": "Черкаська"
  },
  "Кожичі": {
    "lat": 49.887474,
    "lng": 23.865362,
    "region": "Львівська"
  },
  "Мислова": {
    "lat": 49.50542,
    "lng": 26.143,
    "region": "Тернопільська"
  },
  "Городецьке": {
    "lat": 48.7683517,
    "lng": 30.1497847,
    "region": "Черкаська"
  },
  "Вишня": {
    "lat": 49.674042,
    "lng": 23.481878,
    "region": "Львівська"
  },
  "Грузевиця": {
    "lat": 49.475899,
    "lng": 26.83239,
    "region": "Хмельницька"
  },
  "Будьків": {
    "lat": 49.682564,
    "lng": 24.184078,
    "region": "Львівська"
  },
  "Артищів": {
    "lat": 49.76532,
    "lng": 23.67622,
    "region": "Львівська"
  },
  "Красносілка": {
    "lat": 48.5018211,
    "lng": 29.6271958,
    "region": "Вінницька"
  },
  "Великі Дмитровичі": {
    "lat": 50.19997,
    "lng": 30.55607,
    "region": "Київська"
  },
  "Андріївка": {
    "lat": 47.4625561,
    "lng": 37.6528923,
    "region": "Донецька"
  },
  "Сухий Лиман": {
    "lat": 46.3861,
    "lng": 30.6542,
    "region": "Одеська"
  },
  "Тальне": {
    "lat": 48.8889723,
    "lng": 30.6980137,
    "region": "Черкаська"
  },
  "Шишлівці": {
    "lat": 48.57468,
    "lng": 22.206461,
    "region": "Закарпатська"
  },
  "Тростянець": {
    "lat": 50.4833,
    "lng": 34.9667,
    "region": "Сумська"
  },
  "Кременище": {
    "lat": 50.298744,
    "lng": 30.466331,
    "region": "Київська"
  },
  "Пряжів": {
    "lat": 50.1887972,
    "lng": 28.6727284,
    "region": "Житомирська"
  },
  "Наркевичі": {
    "lat": 49.5175956,
    "lng": 26.6433166,
    "region": "Хмельницька"
  },
  "Лісники": {
    "lat": 50.3014,
    "lng": 30.5217,
    "region": "Київська"
  },
  "Бреч": {
    "lat": 51.735989,
    "lng": 32.34066,
    "region": "Чернігівська"
  },
  "Герасимівка": {
    "lat": 48.7605734,
    "lng": 39.7347491,
    "region": "Луганська"
  },
  "Самар": {
    "lat": 48.6333,
    "lng": 35.2167,
    "region": "Дніпропетровська"
  },
  "Лизогубівка": {
    "lat": 49.813728,
    "lng": 36.383282,
    "region": "Харківська"
  },
  "Ходорків": {
    "lat": 50.1032448,
    "lng": 29.293954,
    "region": "Житомирська"
  },
  "Підзамочок": {
    "lat": 49.076656,
    "lng": 25.402742,
    "region": "Тернопільська"
  },
  "Житомир": {
    "lat": 50.2601065,
    "lng": 28.6696281,
    "region": "Житомирська"
  },
  "Козинці": {
    "lat": 50.51479,
    "lng": 30.05825,
    "region": "Київська"
  },
  "Головашівка": {
    "lat": 50.970718,
    "lng": 34.553028,
    "region": "Сумська"
  },
  "Великий Луг": {
    "lat": 50.4333032,
    "lng": 28.0290335,
    "region": "Житомирська"
  },
  "Стрижавка": {
    "lat": 49.3097584,
    "lng": 28.4730593,
    "region": "Вінницька"
  },
  "Славута": {
    "lat": 50.3,
    "lng": 26.8667,
    "region": "Хмельницька"
  },
  "Поправка": {
    "lat": 49.675239,
    "lng": 30.2561496,
    "region": "Київська"
  },
  "Ланчин": {
    "lat": 48.5554737,
    "lng": 24.7523396,
    "region": "Івано-Франківська"
  },
  "Єзупіль": {
    "lat": 49.0416938,
    "lng": 24.7802375,
    "region": "Івано-Франківська"
  },
  "Крушинка": {
    "lat": 50.2319,
    "lng": 30.3708,
    "region": "Київська"
  },
  "Мерефа": {
    "lat": 49.8167,
    "lng": 36.05,
    "region": "Харківська"
  },
  "Грушвиця Друга": {
    "lat": 50.533829,
    "lng": 26.043402,
    "region": "Рівненська"
  },
  "Сурсько-Литовське": {
    "lat": 48.3333,
    "lng": 34.9333,
    "region": "Дніпропетровська"
  },
  "Чорнявка": {
    "lat": 49.2601137,
    "lng": 32.2717157,
    "region": "Черкаська"
  },
  "Ольшана": {
    "lat": 49.2164667,
    "lng": 31.2114781,
    "region": "Черкаська"
  },
  "Світанок": {
    "lat": 50.6333225,
    "lng": 26.8291605,
    "region": "Рівненська"
  },
  "Віта-Поштова": {
    "lat": 50.3183,
    "lng": 30.3847,
    "region": "Київська"
  },
  "Дусино": {
    "lat": 48.512192,
    "lng": 23.107679,
    "region": "Закарпатська"
  },
  "Буховичі": {
    "lat": 49.726334,
    "lng": 23.129408,
    "region": "Львівська"
  },
  "Гульськ": {
    "lat": 50.52132,
    "lng": 27.717131,
    "region": "Житомирська"
  },
  "Новомайське": {
    "lat": 47.9772647,
    "lng": 33.5349099,
    "region": "Дніпропетровська"
  },
  "Блиставиця": {
    "lat": 50.59959,
    "lng": 30.175671,
    "region": "Київська"
  },
  "Желдець": {
    "lat": 50.1084637,
    "lng": 24.1636854,
    "region": "Львівська"
  },
  "Смолівка": {
    "lat": 50.249062,
    "lng": 28.99464,
    "region": "Житомирська"
  },
  "Теслугів": {
    "lat": 50.30571,
    "lng": 25.30975,
    "region": "Рівненська"
  },
  "Дніпровське": {
    "lat": 48.59733,
    "lng": 34.42806,
    "region": "Дніпропетровська"
  },
  "Вільнокур'янівське": {
    "lat": 47.962872,
    "lng": 35.198479,
    "region": "Запорізька"
  },
  "Вишневе": {
    "lat": 50.3917497,
    "lng": 30.3678999,
    "region": "Київська"
  },
  "Хуторо-Губиниха": {
    "lat": 48.710972,
    "lng": 35.083462,
    "region": "Дніпропетровська"
  },
  "Пасіки-Зубрицькі": {
    "lat": 49.7667,
    "lng": 24.0833,
    "region": "Львівська"
  },
  "Хмільна": {
    "lat": 50.491299,
    "lng": 30.034206,
    "region": "Київська"
  },
  "Вільноуланівське": {
    "lat": 47.955673,
    "lng": 35.182384,
    "region": "Запорізька"
  },
  "Копилів": {
    "lat": 50.40871,
    "lng": 29.895861,
    "region": "Київська"
  },
  "Узин": {
    "lat": 49.8284745,
    "lng": 30.4197205,
    "region": "Київська"
  },
  "Волошине": {
    "lat": 46.1137698,
    "lng": 33.6455285,
    "region": "Київська"
  },
  "Якушинці": {
    "lat": 49.259651,
    "lng": 28.36672,
    "region": "Вінницька"
  },
  "Гнаровське": {
    "lat": 48.017811,
    "lng": 35.27676,
    "region": "Запорізька"
  },
  "Цибулівка": {
    "lat": 47.082939,
    "lng": 30.161591,
    "region": "Одеська"
  },
  "Піщана": {
    "lat": 48.12664,
    "lng": 29.73278,
    "region": "Одеська"
  },
  "Світле": {
    "lat": 48.4047223,
    "lng": 37.1169558,
    "region": "Донецька"
  },
  "Боярка": {
    "lat": 50.3356709,
    "lng": 30.2847595,
    "region": "Київська"
  },
  "Радчиці": {
    "lat": 51.33091,
    "lng": 28.832241,
    "region": "Житомирська"
  },
  "Камчик": {
    "lat": 45.9918256,
    "lng": 29.6913364,
    "region": "Одеська"
  },
  "Устя": {
    "lat": 48.5705,
    "lng": 26.6415,
    "region": "Хмельницька"
  },
  "Арциз": {
    "lat": 45.9917,
    "lng": 29.4167,
    "region": "Одеська"
  },
  "Рудне": {
    "lat": 49.8417,
    "lng": 23.8833,
    "region": "Львівська"
  },
  "Калаглія": {
    "lat": 46.285133,
    "lng": 30.360111,
    "region": "Одеська"
  },
  "Тиврів": {
    "lat": 49.0139727,
    "lng": 28.507999,
    "region": "Вінницька"
  },
  "Троїцьке": {
    "lat": 49.9074486,
    "lng": 38.2868192,
    "region": "Луганська"
  },
  "Камінь-Каширський": {
    "lat": 51.6167,
    "lng": 24.9667,
    "region": "Волинська"
  },
  "Буда": {
    "lat": 49.524311,
    "lng": 30.62405,
    "region": "Київська"
  },
  "Весняне": {
    "lat": 50.6841782,
    "lng": 27.2354589,
    "region": "Рівненська"
  },
  "Маків": {
    "lat": 48.795036,
    "lng": 26.691282,
    "region": "Хмельницька"
  },
  "Піщанка": {
    "lat": 48.6,
    "lng": 35.3167,
    "region": "Дніпропетровська"
  },
  "Непедівка": {
    "lat": 49.778019,
    "lng": 28.80547,
    "region": "Вінницька"
  },
  "Петрушки": {
    "lat": 50.42165,
    "lng": 30.162504,
    "region": "Київська"
  },
  "Кам'янське": {
    "lat": 48.5167748,
    "lng": 34.6068797,
    "region": "Дніпропетровська"
  },
  "Микулинці": {
    "lat": 49.39968,
    "lng": 25.60261,
    "region": "Тернопільська"
  },
  "Голубине": {
    "lat": 48.57296,
    "lng": 22.967951,
    "region": "Закарпатська"
  },
  "Томашпіль": {
    "lat": 48.5487589,
    "lng": 28.5188146,
    "region": "Вінницька"
  },
  "Чинадієво": {
    "lat": 48.5005201,
    "lng": 22.84435,
    "region": "Закарпатська"
  },
  "Новоукраїнка": {
    "lat": 48.3167,
    "lng": 31.5333,
    "region": "Кіровоградська"
  },
  "Мала Данилівка": {
    "lat": 50.05,
    "lng": 36.1667,
    "region": "Харківська"
  },
  "Чорноморськ": {
    "lat": 46.3013422,
    "lng": 30.6549271,
    "region": "Одеська"
  },
  "Могилів-Подільський": {
    "lat": 48.45,
    "lng": 27.7833,
    "region": "Вінницька"
  },
  "Вельбівка": {
    "lat": 50.360199,
    "lng": 34.032307,
    "region": "Полтавська"
  },
  "Шахтарське": {
    "lat": 48.3505864,
    "lng": 36.402296,
    "region": "Дніпропетровська"
  },
  "Рогозів": {
    "lat": 50.233883,
    "lng": 31.054955,
    "region": "Київська"
  },
  "Милушин": {
    "lat": 50.7802401,
    "lng": 25.2455078,
    "region": "Волинська"
  },
  "Скнилів": {
    "lat": 49.805237,
    "lng": 23.951488,
    "region": "Львівська"
  },
  "Очаків": {
    "lat": 46.6145957,
    "lng": 31.5452994,
    "region": "Миколаївська"
  },
  "Нова Басань": {
    "lat": 50.572811,
    "lng": 31.5184,
    "region": "Чернігівська"
  },
  "Козелець": {
    "lat": 50.9,
    "lng": 31.1167,
    "region": "Чернігівська"
  },
  "Підбуж": {
    "lat": 49.3315558,
    "lng": 23.2509978,
    "region": "Львівська"
  },
  "Берлози": {
    "lat": 50.894508,
    "lng": 31.15929,
    "region": "Чернігівська"
  },
  "Нові Безрадичі": {
    "lat": 50.1764,
    "lng": 30.5967,
    "region": "Київська"
  },
  "Вербова": {
    "lat": 49.849091,
    "lng": 30.526199,
    "region": "Київська"
  },
  "Синява": {
    "lat": 49.664001,
    "lng": 30.455151,
    "region": "Київська"
  },
  "Піски": {
    "lat": 48.06604,
    "lng": 37.67452,
    "region": "Донецька"
  },
  "Петрівці": {
    "lat": 49.8793357,
    "lng": 33.5114064,
    "region": "Полтавська"
  },
  "Дубіївка": {
    "lat": 49.3490818,
    "lng": 31.8700709,
    "region": "Черкаська"
  },
  "Трускавець": {
    "lat": 49.2782012,
    "lng": 23.5059668,
    "region": "Львівська"
  },
  "Стовп'яги": {
    "lat": 50.068897,
    "lng": 31.353523,
    "region": "Київська"
  },
  "Чечельник": {
    "lat": 48.2126987,
    "lng": 29.3598689,
    "region": "Вінницька"
  },
  "Надвірна": {
    "lat": 48.6333,
    "lng": 24.5833,
    "region": "Івано-Франківська"
  },
  "Аркадіївці": {
    "lat": 49.5104491,
    "lng": 27.161937,
    "region": "Хмельницька"
  },
  "Томашгород": {
    "lat": 51.30237,
    "lng": 27.0686,
    "region": "Рівненська"
  },
  "Любитів": {
    "lat": 51.14616,
    "lng": 24.824301,
    "region": "Волинська"
  },
  "Виноградів": {
    "lat": 48.1408,
    "lng": 23.0336,
    "region": "Закарпатська"
  },
  "Агрономічне": {
    "lat": 47.85885,
    "lng": 38.1926,
    "region": "Донецька"
  },
  "Хотин": {
    "lat": 48.5,
    "lng": 26.5,
    "region": "Чернівецька"
  },
  "Велика Бугаївка": {
    "lat": 50.1784093,
    "lng": 30.4492095,
    "region": "Київська"
  },
  "Ларжанка": {
    "lat": 45.3551582,
    "lng": 28.7147385,
    "region": "Одеська"
  },
  "Басівка": {
    "lat": 49.780231,
    "lng": 23.90766,
    "region": "Львівська"
  },
  "Грабів": {
    "lat": 50.72456,
    "lng": 26.10146,
    "region": "Рівненська"
  },
  "Яремче": {
    "lat": 48.45,
    "lng": 24.55,
    "region": "Івано-Франківська"
  },
  "Малинівка": {
    "lat": 49.705238,
    "lng": 23.831751,
    "region": "Львівська"
  },
  "Угорники": {
    "lat": 48.725361,
    "lng": 24.850651,
    "region": "Івано-Франківська"
  },
  "Іванівка": {
    "lat": 48.23788,
    "lng": 38.9352,
    "region": "Луганська"
  },
  "Слатине": {
    "lat": 50.2091002,
    "lng": 36.1571998,
    "region": "Харківська"
  },
  "Орлове": {
    "lat": 47.06234,
    "lng": 35.564121,
    "region": "Запорізька"
  },
  "Малехів": {
    "lat": 49.8833,
    "lng": 24.0667,
    "region": "Львівська"
  },
  "Старі Кодаки": {
    "lat": 48.381451,
    "lng": 35.132481,
    "region": "Дніпропетровська"
  },
  "Обухівка": {
    "lat": 48.5444,
    "lng": 34.8694,
    "region": "Дніпропетровська"
  },
  "Біла": {
    "lat": 49.04091,
    "lng": 25.76294,
    "region": "Тернопільська"
  },
  "Клузів": {
    "lat": 48.958511,
    "lng": 24.723021,
    "region": "Івано-Франківська"
  },
  "Бахмач": {
    "lat": 51.1833,
    "lng": 32.8333,
    "region": "Чернігівська"
  },
  "Чулатів": {
    "lat": 51.969791,
    "lng": 33.343849,
    "region": "Чернігівська"
  },
  "Мархалівка": {
    "lat": 50.2764,
    "lng": 30.3708,
    "region": "Київська"
  },
  "Новопетрівка": {
    "lat": 47.0592178,
    "lng": 32.6714518,
    "region": "Миколаївська"
  },
  "Пушкове": {
    "lat": 48.2564891,
    "lng": 30.5909592,
    "region": "Кіровоградська"
  },
  "Вільшани": {
    "lat": 50.0513573,
    "lng": 35.8839188,
    "region": "Харківська"
  },
  "Телешівка": {
    "lat": 49.7657996,
    "lng": 30.6117467,
    "region": "Київська"
  },
  "Петрівка": {
    "lat": 48.6013803,
    "lng": 38.6018666,
    "region": "Луганська"
  },
  "Радомишль": {
    "lat": 50.5,
    "lng": 29.2333,
    "region": "Житомирська"
  },
  "Горбанівка": {
    "lat": 49.948353,
    "lng": 25.373335,
    "region": "Львівська"
  },
  "Рогатин": {
    "lat": 49.4167,
    "lng": 24.6167,
    "region": "Івано-Франківська"
  },
  "Любимівка": {
    "lat": 48.0476209,
    "lng": 39.4380524,
    "region": "Луганська"
  },
  "Бібрка": {
    "lat": 49.6375667,
    "lng": 24.2973942,
    "region": "Львівська"
  },
  "Березанка": {
    "lat": 46.8544054,
    "lng": 31.3874915,
    "region": "Миколаївська"
  },
  "Слов'янськ": {
    "lat": 48.8522691,
    "lng": 37.6058241,
    "region": "Донецька"
  },
  "Михайлівка-Рубежівка": {
    "lat": 50.5014,
    "lng": 30.1517,
    "region": "Київська"
  },
  "Дроздні": {
    "lat": 51.110802,
    "lng": 24.86961,
    "region": "Волинська"
  },
  "Велика Бийгань": {
    "lat": 48.248535,
    "lng": 22.576393,
    "region": "Закарпатська"
  },
  "Родниківка": {
    "lat": 48.69724,
    "lng": 22.8941399,
    "region": "Закарпатська"
  },
  "Старосільці": {
    "lat": 50.4075891,
    "lng": 28.9990795,
    "region": "Житомирська"
  },
  "Вінницькі Хутори": {
    "lat": 49.20467,
    "lng": 28.55072,
    "region": "Вінницька"
  },
  "Смерклів": {
    "lat": 48.9398638,
    "lng": 25.1410852,
    "region": "Івано-Франківська"
  },
  "Гелетина": {
    "lat": 48.710434,
    "lng": 26.809669,
    "region": "Хмельницька"
  },
  "Пасіка": {
    "lat": 48.531551,
    "lng": 22.903894,
    "region": "Закарпатська"
  },
  "Черкаська Лозова": {
    "lat": 50.1044527,
    "lng": 36.2222923,
    "region": "Харківська"
  },
  "Оленеве": {
    "lat": 48.66737,
    "lng": 22.87525,
    "region": "Закарпатська"
  },
  "Щасливе": {
    "lat": 50.3833,
    "lng": 30.7833,
    "region": "Київська"
  },
  "Глеваха": {
    "lat": 50.2667,
    "lng": 30.3167,
    "region": "Київська"
  },
  "Рудківці": {
    "lat": 48.640591,
    "lng": 27.347031,
    "region": "Хмельницька"
  },
  "Свидниця": {
    "lat": 49.99123,
    "lng": 23.19626,
    "region": "Львівська"
  },
  "Гориславці": {
    "lat": 49.1988534,
    "lng": 33.3362559,
    "region": "Полтавська"
  },
  "Солочин": {
    "lat": 48.602474,
    "lng": 22.965557,
    "region": "Закарпатська"
  },
  "Северинівка": {
    "lat": 49.575802,
    "lng": 30.291019,
    "region": "Київська"
  },
  "Загальці": {
    "lat": 50.662418,
    "lng": 29.80488,
    "region": "Київська"
  },
  "Хоцьки": {
    "lat": 49.902988,
    "lng": 31.64887,
    "region": "Київська"
  },
  "Бар": {
    "lat": 49.075,
    "lng": 27.6833,
    "region": "Вінницька"
  },
  "Постійне": {
    "lat": 50.916142,
    "lng": 26.11622,
    "region": "Рівненська"
  },
  "Козлів": {
    "lat": 49.55658,
    "lng": 25.33962,
    "region": "Тернопільська"
  },
  "Городище": {
    "lat": 49.2833,
    "lng": 31.45,
    "region": "Черкаська"
  },
  "Нова Дача": {
    "lat": 47.3719796,
    "lng": 36.3567872,
    "region": "Запорізька"
  },
  "Лупареве": {
    "lat": 46.6943404,
    "lng": 31.9816968,
    "region": "Миколаївська"
  },
  "Дачне": {
    "lat": 46.5917,
    "lng": 30.5514,
    "region": "Одеська"
  },
  "Кийлів": {
    "lat": 50.148506,
    "lng": 30.884483,
    "region": "Київська"
  },
  "Бобрик Другий": {
    "lat": 47.901421,
    "lng": 30.158501,
    "region": "Одеська"
  },
  "Бохни": {
    "lat": 49.3755124,
    "lng": 27.7022682,
    "region": "Хмельницька"
  },
  "Новоселиця": {
    "lat": 48.2167,
    "lng": 26.2667,
    "region": "Чернівецька"
  },
  "Вища Дубечня": {
    "lat": 50.73418,
    "lng": 30.65151,
    "region": "Київська"
  },
  "Довжик": {
    "lat": 50.4262228,
    "lng": 34.5799631,
    "region": "Сумська"
  },
  "Білгород-Дністровський": {
    "lat": 46.1833,
    "lng": 30.3333,
    "region": "Одеська"
  },
  "Очеретувате": {
    "lat": 48.434601,
    "lng": 35.711399,
    "region": "Дніпропетровська"
  },
  "Кротошин": {
    "lat": 49.7478436,
    "lng": 24.0903757,
    "region": "Львівська"
  },
  "Бабаї": {
    "lat": 49.8944,
    "lng": 36.1956,
    "region": "Харківська"
  },
  "Лиманка": {
    "lat": 46.3731032,
    "lng": 30.690874,
    "region": "Одеська"
  },
  "Воскодави": {
    "lat": 50.650749,
    "lng": 26.645281,
    "region": "Рівненська"
  },
  "Зеленівка": {
    "lat": 46.7175203,
    "lng": 32.6496911,
    "region": "Херсонська"
  },
  "Давидів": {
    "lat": 49.7417,
    "lng": 24.1389,
    "region": "Львівська"
  },
  "Рованці": {
    "lat": 50.7289478,
    "lng": 25.3426818,
    "region": "Волинська"
  },
  "Кримка": {
    "lat": 45.7040999,
    "lng": 34.1904557,
    "region": "Київська"
  },
  "Березина": {
    "lat": 46.2314064,
    "lng": 29.2026644,
    "region": "Одеська"
  },
  "Мала Кохнівка": {
    "lat": 49.076397,
    "lng": 33.481354,
    "region": "Полтавська"
  },
  "Веселівка": {
    "lat": 51.2343734,
    "lng": 28.8434867,
    "region": "Житомирська"
  },
  "Пересопниця": {
    "lat": 50.6660625,
    "lng": 25.9687944,
    "region": "Рівненська"
  },
  "Баштанка": {
    "lat": 47.4042,
    "lng": 32.4464,
    "region": "Миколаївська"
  },
  "Орлівщина": {
    "lat": 48.65,
    "lng": 35.3667,
    "region": "Дніпропетровська"
  },
  "Маньківка": {
    "lat": 48.9634119,
    "lng": 30.3342681,
    "region": "Черкаська"
  },
  "Брусилів": {
    "lat": 50.2833,
    "lng": 29.5167,
    "region": "Житомирська"
  },
  "Хлібодарське": {
    "lat": 46.4828,
    "lng": 30.591114,
    "region": "Одеська"
  },
  "Займище": {
    "lat": 50.468788,
    "lng": 30.993811,
    "region": "Київська"
  },
  "Дмитрівка": {
    "lat": 50.4508,
    "lng": 30.1881,
    "region": "Київська"
  },
  "Красний Під": {
    "lat": 47.7595603,
    "lng": 33.4615185,
    "region": "Дніпропетровська"
  },
  "Старосілля": {
    "lat": 46.891273,
    "lng": 30.0882,
    "region": "Одеська"
  },
  "Тахтаулове": {
    "lat": 49.662498,
    "lng": 34.5275,
    "region": "Полтавська"
  },
  "Озера": {
    "lat": 50.311275,
    "lng": 34.422054,
    "region": "Сумська"
  },
  "Татарів": {
    "lat": 48.3333,
    "lng": 24.5667,
    "region": "Івано-Франківська"
  },
  "Путивль": {
    "lat": 51.3333,
    "lng": 33.8667,
    "region": "Сумська"
  },
  "Коцюбинське": {
    "lat": 50.4904717,
    "lng": 30.3337903,
    "region": "Київська"
  },
  "Поліське": {
    "lat": 51.240486,
    "lng": 29.38896,
    "region": "Київська"
  },
  "Володарка": {
    "lat": 49.5224979,
    "lng": 29.9280475,
    "region": "Київська"
  },
  "Лисогубівка": {
    "lat": 51.316109,
    "lng": 33.166351,
    "region": "Сумська"
  },
  "Ярешки": {
    "lat": 50.40781,
    "lng": 31.561165,
    "region": "Київська"
  },
  "Помонята": {
    "lat": 49.399349,
    "lng": 24.440886,
    "region": "Івано-Франківська"
  },
  "Гнатівка": {
    "lat": 48.26199,
    "lng": 37.20906,
    "region": "Донецька"
  },
  "Талалаївка": {
    "lat": 50.83168,
    "lng": 33.13442,
    "region": "Чернігівська"
  },
  "Барашівка": {
    "lat": 50.27678,
    "lng": 28.5491751,
    "region": "Житомирська"
  },
  "П'ятихатки": {
    "lat": 48.4124572,
    "lng": 33.7056731,
    "region": "Дніпропетровська"
  },
  "Павлове": {
    "lat": 48.64846,
    "lng": 22.912817,
    "region": "Закарпатська"
  },
  "Іванків": {
    "lat": 50.9333,
    "lng": 29.9,
    "region": "Київська"
  },
  "Модьорош": {
    "lat": 48.072464,
    "lng": 23.350922,
    "region": "Закарпатська"
  },
  "Орв'яниця": {
    "lat": 51.501499,
    "lng": 26.539881,
    "region": "Рівненська"
  },
  "Бобрівка": {
    "lat": 50.049976,
    "lng": 36.392395,
    "region": "Харківська"
  },
  "Хорошеве": {
    "lat": 49.8534152,
    "lng": 36.2239739,
    "region": "Харківська"
  },
  "Снігурівка": {
    "lat": 47.0706,
    "lng": 32.7967,
    "region": "Миколаївська"
  },
  "Осовець": {
    "lat": 50.860859,
    "lng": 29.55872,
    "region": "Київська"
  },
  "Дубриничі": {
    "lat": 48.7772,
    "lng": 22.4878,
    "region": "Закарпатська"
  },
  "Дубрыничи": {
    "lat": 48.7772,
    "lng": 22.4878,
    "region": "Закарпатська"
  },
  "Чоп": {
    "lat": 48.4319,
    "lng": 22.2081,
    "region": "Закарпатська"
  },
  "Тячів": {
    "lat": 48.0117,
    "lng": 23.5714,
    "region": "Закарпатська"
  },
  "Рахів": {
    "lat": 48.0536,
    "lng": 24.2081,
    "region": "Закарпатська"
  },
  "Іршава": {
    "lat": 48.3183,
    "lng": 23.0378,
    "region": "Закарпатська"
  },
  "Воловець": {
    "lat": 48.7111,
    "lng": 23.1878,
    "region": "Закарпатська"
  },
  "Міжгір'я": {
    "lat": 48.5283,
    "lng": 23.5042,
    "region": "Закарпатська"
  },
  "Великий Березний": {
    "lat": 48.8925,
    "lng": 22.4589,
    "region": "Закарпатська"
  },
  "Солотвино": {
    "lat": 47.9572,
    "lng": 23.8731,
    "region": "Закарпатська"
  },
  "Шаян": {
    "lat": 48.0583,
    "lng": 23.3486,
    "region": "Закарпатська"
  },
  "Прибужани": {
    "lat": 47.5256,
    "lng": 31.3061,
    "region": "Миколаївська"
  },
  "Прибужаны": {
    "lat": 47.5256,
    "lng": 31.3061,
    "region": "Миколаївська"
  },
  "Южноукраїнськ": {
    "lat": 47.8217,
    "lng": 31.1764,
    "region": "Миколаївська"
  },
  "Новий Буг": {
    "lat": 47.6833,
    "lng": 32.5167,
    "region": "Миколаївська"
  },
  "Коблеве": {
    "lat": 46.6631,
    "lng": 31.2056,
    "region": "Миколаївська"
  },
  "Рибаківка": {
    "lat": 46.6214,
    "lng": 31.3411,
    "region": "Миколаївська"
  },
  "Чорноморка": {
    "lat": 46.5983,
    "lng": 31.4889,
    "region": "Миколаївська"
  },
  "Крижанівка": {
    "lat": 46.5614,
    "lng": 30.7967,
    "region": "Одеська"
  },
  "Крыжановка": {
    "lat": 46.5614,
    "lng": 30.7967,
    "region": "Одеська"
  },
  "Лески": {
    "lat": 46.5517,
    "lng": 30.8142,
    "region": "Одеська"
  },
  "Чорноморське": {
    "lat": 46.5878,
    "lng": 30.9389,
    "region": "Одеська"
  },
  "Черноморское": {
    "lat": 46.5878,
    "lng": 30.9389,
    "region": "Одеська"
  },
  "Вапнярка": {
    "lat": 46.5786,
    "lng": 30.8872,
    "region": "Одеська"
  },
  "Дофінівка": {
    "lat": 46.5822,
    "lng": 30.9064,
    "region": "Одеська"
  },
  "Сухой Лиман": {
    "lat": 46.3861,
    "lng": 30.6542,
    "region": "Одеська"
  },
  "Таїрове": {
    "lat": 46.3775,
    "lng": 30.6481,
    "region": "Одеська"
  },
  "Таирово": {
    "lat": 46.3775,
    "lng": 30.6481,
    "region": "Одеська"
  },
  "Совіньйон": {
    "lat": 46.3353,
    "lng": 30.6867,
    "region": "Одеська"
  },
  "Совиньон": {
    "lat": 46.3353,
    "lng": 30.6867,
    "region": "Одеська"
  },
  "Бурлача Балка": {
    "lat": 46.3408,
    "lng": 30.6653,
    "region": "Одеська"
  },
  "Санжійка": {
    "lat": 46.2289,
    "lng": 30.6033,
    "region": "Одеська"
  },
  "Санжейка": {
    "lat": 46.2289,
    "lng": 30.6033,
    "region": "Одеська"
  },
  "Усатове": {
    "lat": 46.5333,
    "lng": 30.6583,
    "region": "Одеська"
  },
  "Усатово": {
    "lat": 46.5333,
    "lng": 30.6583,
    "region": "Одеська"
  },
  "Нерубайське": {
    "lat": 46.5456,
    "lng": 30.6275,
    "region": "Одеська"
  },
  "Нерубайское": {
    "lat": 46.5456,
    "lng": 30.6275,
    "region": "Одеська"
  },
  "Дачное": {
    "lat": 46.5917,
    "lng": 30.5514,
    "region": "Одеська"
  },
  "Авангард": {
    "lat": 46.4689,
    "lng": 30.6253,
    "region": "Одеська"
  },
  "Прилиманське": {
    "lat": 46.4306,
    "lng": 30.6128,
    "region": "Одеська"
  },
  "Южне": {
    "lat": 46.6219,
    "lng": 31.1008,
    "region": "Одеська"
  },
  "Южный": {
    "lat": 49.8833,
    "lng": 36.0667,
    "region": "Харківська"
  },
  "Біляївка": {
    "lat": 46.4833,
    "lng": 30.2333,
    "region": "Одеська"
  },
  "Подольск": {
    "lat": 47.7425,
    "lng": 29.5339,
    "region": "Одеська"
  },
  "Котовськ": {
    "lat": 47.7425,
    "lng": 29.5339,
    "region": "Одеська"
  },
  "Балта": {
    "lat": 47.9333,
    "lng": 29.6167,
    "region": "Одеська"
  },
  "Роздільна": {
    "lat": 46.85,
    "lng": 30.0833,
    "region": "Одеська"
  },
  "Болград": {
    "lat": 45.6833,
    "lng": 28.6167,
    "region": "Одеська"
  },
  "Рені": {
    "lat": 45.45,
    "lng": 28.2833,
    "region": "Одеська"
  },
  "Кілія": {
    "lat": 45.45,
    "lng": 29.2667,
    "region": "Одеська"
  },
  "Вилкове": {
    "lat": 45.4,
    "lng": 29.6,
    "region": "Одеська"
  },
  "Белогородка": {
    "lat": 50.3997,
    "lng": 30.2289,
    "region": "Київська"
  },
  "Зазимʼя": {
    "lat": 50.5683,
    "lng": 30.6792,
    "region": "Київська"
  },
  "Зазимье": {
    "lat": 50.5683,
    "lng": 30.6792,
    "region": "Київська"
  },
  "Погреби": {
    "lat": 50.5494,
    "lng": 30.6406,
    "region": "Київська"
  },
  "Погребы": {
    "lat": 50.5494,
    "lng": 30.6406,
    "region": "Київська"
  },
  "Літки": {
    "lat": 50.7042,
    "lng": 30.7561,
    "region": "Київська"
  },
  "Летки": {
    "lat": 50.7042,
    "lng": 30.7561,
    "region": "Київська"
  },
  "Пуховка": {
    "lat": 50.6067,
    "lng": 30.7103,
    "region": "Київська"
  },
  "Хотяновка": {
    "lat": 50.6053,
    "lng": 30.5739,
    "region": "Київська"
  },
  "Новые Петровцы": {
    "lat": 50.6225,
    "lng": 30.4464,
    "region": "Київська"
  },
  "Старые Петровцы": {
    "lat": 50.6558,
    "lng": 30.4069,
    "region": "Київська"
  },
  "Лютеж": {
    "lat": 50.6864,
    "lng": 30.3953,
    "region": "Київська"
  },
  "Новые Безрадичи": {
    "lat": 50.1764,
    "lng": 30.5967,
    "region": "Київська"
  },
  "Старі Безрадичі": {
    "lat": 50.1583,
    "lng": 30.5833,
    "region": "Київська"
  },
  "Українка": {
    "lat": 50.1444,
    "lng": 30.7486,
    "region": "Київська"
  },
  "Украинка": {
    "lat": 50.1444,
    "lng": 30.7486,
    "region": "Київська"
  },
  "Трипілля": {
    "lat": 50.1236,
    "lng": 30.7714,
    "region": "Київська"
  },
  "Триполье": {
    "lat": 50.1236,
    "lng": 30.7714,
    "region": "Київська"
  },
  "Подгорцы": {
    "lat": 50.2458,
    "lng": 30.5517,
    "region": "Київська"
  },
  "Романків": {
    "lat": 50.2644,
    "lng": 30.5692,
    "region": "Київська"
  },
  "Романков": {
    "lat": 50.2644,
    "lng": 30.5692,
    "region": "Київська"
  },
  "Ходосовка": {
    "lat": 50.2728,
    "lng": 30.5222,
    "region": "Київська"
  },
  "Лесники": {
    "lat": 50.3014,
    "lng": 30.5217,
    "region": "Київська"
  },
  "Креничі": {
    "lat": 50.2306,
    "lng": 30.4939,
    "region": "Київська"
  },
  "Дмитровка": {
    "lat": 50.4508,
    "lng": 30.1881,
    "region": "Київська"
  },
  "Мила": {
    "lat": 50.4431,
    "lng": 30.1706,
    "region": "Київська"
  },
  "Милая": {
    "lat": 50.4431,
    "lng": 30.1706,
    "region": "Київська"
  },
  "Чайки": {
    "lat": 50.4356,
    "lng": 30.2981,
    "region": "Київська"
  },
  "Петропавловская Борщаговка": {
    "lat": 50.4344,
    "lng": 30.3347,
    "region": "Київська"
  },
  "Софиевская Борщаговка": {
    "lat": 50.4089,
    "lng": 30.3683,
    "region": "Київська"
  },
  "Святопетровское": {
    "lat": 50.3861,
    "lng": 30.3208,
    "region": "Київська"
  },
  "Шевченково": {
    "lat": 50.4056,
    "lng": 30.2611,
    "region": "Київська"
  },
  "Бобрица": {
    "lat": 50.3547,
    "lng": 30.1986,
    "region": "Київська"
  },
  "Музичі": {
    "lat": 50.3556,
    "lng": 30.1194,
    "region": "Київська"
  },
  "Музычи": {
    "lat": 50.3556,
    "lng": 30.1194,
    "region": "Київська"
  },
  "Княжичі": {
    "lat": 50.4608,
    "lng": 30.7811,
    "region": "Київська"
  },
  "Княжичи": {
    "lat": 50.4608,
    "lng": 30.7811,
    "region": "Київська"
  },
  "Гореничи": {
    "lat": 50.4206,
    "lng": 30.2106,
    "region": "Київська"
  },
  "Стоянка": {
    "lat": 50.4542,
    "lng": 30.2319,
    "region": "Київська"
  },
  "Михайловка-Рубежовка": {
    "lat": 50.5014,
    "lng": 30.1517,
    "region": "Київська"
  },
  "Мощун": {
    "lat": 50.6042,
    "lng": 30.3083,
    "region": "Київська"
  },
  "Колонщина": {
    "lat": 50.45,
    "lng": 29.9667,
    "region": "Київська"
  },
  "Макарів": {
    "lat": 50.4667,
    "lng": 29.8167,
    "region": "Київська"
  },
  "Макаров": {
    "lat": 50.4667,
    "lng": 29.8167,
    "region": "Київська"
  },
  "Мархалевка": {
    "lat": 50.2764,
    "lng": 30.3708,
    "region": "Київська"
  },
  "Иванковичи": {
    "lat": 50.2736,
    "lng": 30.4361,
    "region": "Київська"
  },
  "Гатное": {
    "lat": 50.3606,
    "lng": 30.3956,
    "region": "Київська"
  },
  "Хотов": {
    "lat": 50.3347,
    "lng": 30.4722,
    "region": "Київська"
  },
  "Вита-Почтовая": {
    "lat": 50.3183,
    "lng": 30.3847,
    "region": "Київська"
  },
  "Юрівка": {
    "lat": 50.3389,
    "lng": 30.3667,
    "region": "Київська"
  },
  "Юровка": {
    "lat": 50.3389,
    "lng": 30.3667,
    "region": "Київська"
  },
  "Крюковщина": {
    "lat": 50.3683,
    "lng": 30.3683,
    "region": "Київська"
  },
  "Тарасовка": {
    "lat": 50.3417,
    "lng": 30.3083,
    "region": "Київська"
  },
  "Забір'я": {
    "lat": 50.3167,
    "lng": 30.2333,
    "region": "Київська"
  },
  "Заборье": {
    "lat": 50.3167,
    "lng": 30.2333,
    "region": "Київська"
  },
  "Гнедин": {
    "lat": 50.3314,
    "lng": 30.7061,
    "region": "Київська"
  },
  "Вишенки": {
    "lat": 50.3014,
    "lng": 30.7292,
    "region": "Київська"
  },
  "Проців": {
    "lat": 50.2417,
    "lng": 30.7833,
    "region": "Київська"
  },
  "Процев": {
    "lat": 50.2417,
    "lng": 30.7833,
    "region": "Київська"
  },
  "Чубинське": {
    "lat": 50.3833,
    "lng": 30.8667,
    "region": "Київська"
  },
  "Чубинское": {
    "lat": 50.3833,
    "lng": 30.8667,
    "region": "Київська"
  },
  "Счастливое": {
    "lat": 50.3833,
    "lng": 30.7833,
    "region": "Київська"
  },
  "Требухів": {
    "lat": 50.4833,
    "lng": 30.9,
    "region": "Київська"
  },
  "Требухов": {
    "lat": 50.4833,
    "lng": 30.9,
    "region": "Київська"
  },
  "Красиловка": {
    "lat": 50.5167,
    "lng": 30.9167,
    "region": "Київська"
  },
  "Скибин": {
    "lat": 50.5833,
    "lng": 30.8333,
    "region": "Київська"
  },
  "Велика Димерка": {
    "lat": 50.5917,
    "lng": 30.9139,
    "region": "Київська"
  },
  "Великая Дымерка": {
    "lat": 50.5917,
    "lng": 30.9139,
    "region": "Київська"
  },
  "Рожівка": {
    "lat": 50.5667,
    "lng": 30.75,
    "region": "Київська"
  },
  "Рожевка": {
    "lat": 50.5667,
    "lng": 30.75,
    "region": "Київська"
  },
  "Переяслав": {
    "lat": 50.0667,
    "lng": 31.45,
    "region": "Київська"
  },
  "Кагарлик": {
    "lat": 49.8667,
    "lng": 30.8167,
    "region": "Київська"
  },
  "Богуслав": {
    "lat": 49.55,
    "lng": 30.8833,
    "region": "Київська"
  },
  "Тараща": {
    "lat": 49.5667,
    "lng": 30.5,
    "region": "Київська"
  },
  "Сквира": {
    "lat": 49.7333,
    "lng": 29.6833,
    "region": "Київська"
  },
  "Тетіїв": {
    "lat": 49.3667,
    "lng": 29.65,
    "region": "Київська"
  },
  "Бородянка": {
    "lat": 50.65,
    "lng": 29.9167,
    "region": "Київська"
  },
  "Бабаи": {
    "lat": 49.8944,
    "lng": 36.1956,
    "region": "Харківська"
  },
  "Покотиловка": {
    "lat": 49.9142,
    "lng": 36.1736,
    "region": "Харківська"
  },
  "Высокий": {
    "lat": 49.8833,
    "lng": 36.1167,
    "region": "Харківська"
  },
  "Південне": {
    "lat": 49.8833,
    "lng": 36.0667,
    "region": "Харківська"
  },
  "Пісочин": {
    "lat": 49.95,
    "lng": 36.1,
    "region": "Харківська"
  },
  "Песочин": {
    "lat": 49.95,
    "lng": 36.1,
    "region": "Харківська"
  },
  "Солоницівка": {
    "lat": 50,
    "lng": 36.0333,
    "region": "Харківська"
  },
  "Солоницевка": {
    "lat": 50,
    "lng": 36.0333,
    "region": "Харківська"
  },
  "Дергачи": {
    "lat": 50.1167,
    "lng": 36.1167,
    "region": "Харківська"
  },
  "Малая Даниловка": {
    "lat": 50.05,
    "lng": 36.1667,
    "region": "Харківська"
  },
  "Циркуни": {
    "lat": 50.0833,
    "lng": 36.3833,
    "region": "Харківська"
  },
  "Безлюдовка": {
    "lat": 49.8667,
    "lng": 36.2667,
    "region": "Харківська"
  },
  "Васищеве": {
    "lat": 49.8167,
    "lng": 36.3333,
    "region": "Харківська"
  },
  "Васищево": {
    "lat": 49.8167,
    "lng": 36.3333,
    "region": "Харківська"
  },
  "Чугуев": {
    "lat": 49.8333,
    "lng": 36.6833,
    "region": "Харківська"
  },
  "Богодухів": {
    "lat": 50.1667,
    "lng": 35.5333,
    "region": "Харківська"
  },
  "Красноград": {
    "lat": 49.3667,
    "lng": 35.45,
    "region": "Харківська"
  },
  "Куп'янськ": {
    "lat": 49.7167,
    "lng": 37.6167,
    "region": "Харківська"
  },
  "Брюховичи": {
    "lat": 49.9022,
    "lng": 23.9533,
    "region": "Львівська"
  },
  "Сокольники": {
    "lat": 49.7833,
    "lng": 23.95,
    "region": "Львівська"
  },
  "Дубляни": {
    "lat": 49.8972,
    "lng": 24.0917,
    "region": "Львівська"
  },
  "Муроване": {
    "lat": 49.8778,
    "lng": 24.1,
    "region": "Львівська"
  },
  "Пустомити": {
    "lat": 49.7167,
    "lng": 23.9,
    "region": "Львівська"
  },
  "Славське": {
    "lat": 48.85,
    "lng": 23.45,
    "region": "Львівська"
  },
  "Славско": {
    "lat": 48.85,
    "lng": 23.45,
    "region": "Львівська"
  },
  "Жовква": {
    "lat": 50.05,
    "lng": 23.9667,
    "region": "Львівська"
  },
  "Золочів": {
    "lat": 49.8,
    "lng": 24.9,
    "region": "Львівська"
  },
  "Червоноград": {
    "lat": 50.3833,
    "lng": 24.2333,
    "region": "Львівська"
  },
  "Шептицький": {
    "lat": 50.3833,
    "lng": 24.2333,
    "region": "Львівська"
  },
  "Яворів": {
    "lat": 49.9333,
    "lng": 23.4,
    "region": "Львівська"
  },
  "Моршин": {
    "lat": 49.15,
    "lng": 23.8667,
    "region": "Львівська"
  },
  "Новий Розділ": {
    "lat": 49.4667,
    "lng": 24.1333,
    "region": "Львівська"
  },
  "Подгородное": {
    "lat": 48.5756,
    "lng": 35.1053,
    "region": "Дніпропетровська"
  },
  "Обуховка": {
    "lat": 48.5444,
    "lng": 34.8694,
    "region": "Дніпропетровська"
  },
  "Кіровське": {
    "lat": 48.5444,
    "lng": 34.8694,
    "region": "Дніпропетровська"
  },
  "Слобожанское": {
    "lat": 48.5333,
    "lng": 35.0833,
    "region": "Дніпропетровська"
  },
  "Ювілейне": {
    "lat": 48.5333,
    "lng": 35.0833,
    "region": "Дніпропетровська"
  },
  "Новоалександровка": {
    "lat": 48.35,
    "lng": 35,
    "region": "Дніпропетровська"
  },
  "Братське": {
    "lat": 48.3333,
    "lng": 35.05,
    "region": "Дніпропетровська"
  },
  "Песчанка": {
    "lat": 48.6,
    "lng": 35.3167,
    "region": "Дніпропетровська"
  },
  "Новомосковськ": {
    "lat": 48.6333,
    "lng": 35.2167,
    "region": "Дніпропетровська"
  },
  "Жовті Води": {
    "lat": 48.35,
    "lng": 33.5,
    "region": "Дніпропетровська"
  },
  "Марганець": {
    "lat": 47.65,
    "lng": 34.6167,
    "region": "Дніпропетровська"
  },
  "Покров": {
    "lat": 47.65,
    "lng": 34.0833,
    "region": "Дніпропетровська"
  },
  "Орджонікідзе": {
    "lat": 47.65,
    "lng": 34.0833,
    "region": "Дніпропетровська"
  },
  "Першотравенськ": {
    "lat": 48.35,
    "lng": 36.4,
    "region": "Дніпропетровська"
  },
  "Тернівка": {
    "lat": 48.5167,
    "lng": 36.0833,
    "region": "Дніпропетровська"
  },
  "Жмеринка": {
    "lat": 49.0333,
    "lng": 28.1,
    "region": "Вінницька"
  },
  "Могилев-Подольский": {
    "lat": 48.45,
    "lng": 27.7833,
    "region": "Вінницька"
  },
  "Хмільник": {
    "lat": 49.55,
    "lng": 27.95,
    "region": "Вінницька"
  },
  "Хмельник": {
    "lat": 49.55,
    "lng": 27.95,
    "region": "Вінницька"
  },
  "Гайсин": {
    "lat": 48.8167,
    "lng": 29.3833,
    "region": "Вінницька"
  },
  "Казатин": {
    "lat": 49.7167,
    "lng": 28.8333,
    "region": "Вінницька"
  },
  "Ладижин": {
    "lat": 48.6833,
    "lng": 29.2333,
    "region": "Вінницька"
  },
  "Калиновка": {
    "lat": 49.45,
    "lng": 28.5167,
    "region": "Вінницька"
  },
  "Тульчин": {
    "lat": 48.6667,
    "lng": 28.85,
    "region": "Вінницька"
  },
  "Гнівань": {
    "lat": 49.0833,
    "lng": 28.35,
    "region": "Вінницька"
  },
  "Немирів": {
    "lat": 48.9667,
    "lng": 28.85,
    "region": "Вінницька"
  },
  "Немиров": {
    "lat": 48.9667,
    "lng": 28.85,
    "region": "Вінницька"
  },
  "Іллінці": {
    "lat": 49.1,
    "lng": 29.2,
    "region": "Вінницька"
  },
  "Ильинцы": {
    "lat": 49.1,
    "lng": 29.2,
    "region": "Вінницька"
  },
  "Трійця": {
    "lat": 49.1167,
    "lng": 29.2333,
    "region": "Вінницька"
  },
  "Канів": {
    "lat": 49.75,
    "lng": 31.4667,
    "region": "Черкаська"
  },
  "Канев": {
    "lat": 49.75,
    "lng": 31.4667,
    "region": "Черкаська"
  },
  "Смела": {
    "lat": 49.2167,
    "lng": 31.8667,
    "region": "Черкаська"
  },
  "Звенигородка": {
    "lat": 49.0667,
    "lng": 30.9667,
    "region": "Черкаська"
  },
  "Корсунь-Шевченківський": {
    "lat": 49.4167,
    "lng": 31.2833,
    "region": "Черкаська"
  },
  "Шпола": {
    "lat": 49,
    "lng": 31.4,
    "region": "Черкаська"
  },
  "Ватутіне": {
    "lat": 49.0167,
    "lng": 31.0667,
    "region": "Черкаська"
  },
  "Чигирин": {
    "lat": 49.0833,
    "lng": 32.65,
    "region": "Черкаська"
  },
  "Кам'янка": {
    "lat": 49.0333,
    "lng": 32.1,
    "region": "Черкаська"
  },
  "Червона Слобода": {
    "lat": 49.3833,
    "lng": 32.15,
    "region": "Черкаська"
  },
  "Валок": {
    "lat": 49.7,
    "lng": 34.35,
    "region": "Полтавська"
  },
  "Кременчуг": {
    "lat": 49.0667,
    "lng": 33.4167,
    "region": "Полтавська"
  },
  "Горішні Плавні": {
    "lat": 49.0167,
    "lng": 33.65,
    "region": "Полтавська"
  },
  "Горишние Плавни": {
    "lat": 49.0167,
    "lng": 33.65,
    "region": "Полтавська"
  },
  "Комсомольськ": {
    "lat": 49.0167,
    "lng": 33.65,
    "region": "Полтавська"
  },
  "Лубны": {
    "lat": 50.0167,
    "lng": 33,
    "region": "Полтавська"
  },
  "Гадяч": {
    "lat": 50.3667,
    "lng": 33.9833,
    "region": "Полтавська"
  },
  "Пирятин": {
    "lat": 50.25,
    "lng": 32.5,
    "region": "Полтавська"
  },
  "Карлівка": {
    "lat": 49.45,
    "lng": 35.1333,
    "region": "Полтавська"
  },
  "Хорол": {
    "lat": 49.7833,
    "lng": 33.25,
    "region": "Полтавська"
  },
  "Лохвиця": {
    "lat": 50.3667,
    "lng": 33.2667,
    "region": "Полтавська"
  },
  "Глобине": {
    "lat": 49.3833,
    "lng": 33.25,
    "region": "Полтавська"
  },
  "Кобеляки": {
    "lat": 49.15,
    "lng": 34.2,
    "region": "Полтавська"
  },
  "Зіньків": {
    "lat": 50.2,
    "lng": 34.3667,
    "region": "Полтавська"
  },
  "Вербовець": {
    "lat": 48.3333,
    "lng": 25.1333,
    "region": "Івано-Франківська"
  },
  "Вербовец": {
    "lat": 48.3333,
    "lng": 25.1333,
    "region": "Івано-Франківська"
  },
  "Калуш": {
    "lat": 49.0333,
    "lng": 24.3667,
    "region": "Івано-Франківська"
  },
  "Коломыя": {
    "lat": 48.5333,
    "lng": 25.0333,
    "region": "Івано-Франківська"
  },
  "Поляниця": {
    "lat": 48.35,
    "lng": 24.4333,
    "region": "Івано-Франківська"
  },
  "Буковель": {
    "lat": 48.35,
    "lng": 24.4167,
    "region": "Івано-Франківська"
  },
  "Косів": {
    "lat": 48.3167,
    "lng": 25.0833,
    "region": "Івано-Франківська"
  },
  "Долина": {
    "lat": 48.9667,
    "lng": 24,
    "region": "Івано-Франківська"
  },
  "Бурштин": {
    "lat": 49.25,
    "lng": 24.6333,
    "region": "Івано-Франківська"
  },
  "Городенка": {
    "lat": 48.6667,
    "lng": 25.5,
    "region": "Івано-Франківська"
  },
  "Тлумач": {
    "lat": 48.85,
    "lng": 25,
    "region": "Івано-Франківська"
  },
  "Верховина": {
    "lat": 48.15,
    "lng": 24.8333,
    "region": "Івано-Франківська"
  },
  "Бердичев": {
    "lat": 49.9,
    "lng": 28.6,
    "region": "Житомирська"
  },
  "Новоград-Волинський": {
    "lat": 50.5833,
    "lng": 27.6333,
    "region": "Житомирська"
  },
  "Малин": {
    "lat": 50.7667,
    "lng": 29.2333,
    "region": "Житомирська"
  },
  "Коростышев": {
    "lat": 50.3167,
    "lng": 29.0667,
    "region": "Житомирська"
  },
  "Овруч": {
    "lat": 51.3167,
    "lng": 28.8,
    "region": "Житомирська"
  },
  "Радомышль": {
    "lat": 50.5,
    "lng": 29.2333,
    "region": "Житомирська"
  },
  "Брусилов": {
    "lat": 50.2833,
    "lng": 29.5167,
    "region": "Житомирська"
  },
  "Олевськ": {
    "lat": 51.2167,
    "lng": 27.65,
    "region": "Житомирська"
  },
  "Андрушівка": {
    "lat": 50.0167,
    "lng": 29.0167,
    "region": "Житомирська"
  },
  "Каменец-Подольский": {
    "lat": 48.6833,
    "lng": 26.5833,
    "region": "Хмельницька"
  },
  "Шепетовка": {
    "lat": 50.1833,
    "lng": 27.0667,
    "region": "Хмельницька"
  },
  "Нетішин": {
    "lat": 50.3333,
    "lng": 26.65,
    "region": "Хмельницька"
  },
  "Нетешин": {
    "lat": 50.3333,
    "lng": 26.65,
    "region": "Хмельницька"
  },
  "Старокостянтинів": {
    "lat": 49.75,
    "lng": 27.2167,
    "region": "Хмельницька"
  },
  "Староконстантинов": {
    "lat": 49.75,
    "lng": 27.2167,
    "region": "Хмельницька"
  },
  "Полонне": {
    "lat": 50.1167,
    "lng": 27.5167,
    "region": "Хмельницька"
  },
  "Красилів": {
    "lat": 49.65,
    "lng": 26.9667,
    "region": "Хмельницька"
  },
  "Волочиськ": {
    "lat": 49.5333,
    "lng": 26.1833,
    "region": "Хмельницька"
  },
  "Ізяслав": {
    "lat": 50.1167,
    "lng": 26.8,
    "region": "Хмельницька"
  },
  "Нововолинськ": {
    "lat": 50.7333,
    "lng": 24.1667,
    "region": "Волинська"
  },
  "Нововолынск": {
    "lat": 50.7333,
    "lng": 24.1667,
    "region": "Волинська"
  },
  "Володимир": {
    "lat": 50.85,
    "lng": 24.3167,
    "region": "Волинська"
  },
  "Владимир-Волынский": {
    "lat": 50.85,
    "lng": 24.3167,
    "region": "Волинська"
  },
  "Ківерці": {
    "lat": 50.8333,
    "lng": 25.4667,
    "region": "Волинська"
  },
  "Рожище": {
    "lat": 50.9167,
    "lng": 25.2667,
    "region": "Волинська"
  },
  "Любомль": {
    "lat": 51.2167,
    "lng": 24.0333,
    "region": "Волинська"
  },
  "Шацьк": {
    "lat": 51.4833,
    "lng": 23.9333,
    "region": "Волинська"
  },
  "Шацк": {
    "lat": 51.4833,
    "lng": 23.9333,
    "region": "Волинська"
  },
  "Кузнецовськ": {
    "lat": 51.35,
    "lng": 25.85,
    "region": "Рівненська"
  },
  "Сарни": {
    "lat": 51.3333,
    "lng": 26.6,
    "region": "Рівненська"
  },
  "Здолбунів": {
    "lat": 50.5167,
    "lng": 26.25,
    "region": "Рівненська"
  },
  "Березне": {
    "lat": 50.9833,
    "lng": 26.75,
    "region": "Рівненська"
  },
  "Радивилів": {
    "lat": 50.1333,
    "lng": 25.25,
    "region": "Рівненська"
  },
  "Дубровиця": {
    "lat": 51.5667,
    "lng": 26.5667,
    "region": "Рівненська"
  },
  "Чортків": {
    "lat": 49.0167,
    "lng": 25.8,
    "region": "Тернопільська"
  },
  "Чортков": {
    "lat": 49.0167,
    "lng": 25.8,
    "region": "Тернопільська"
  },
  "Кременець": {
    "lat": 50.1,
    "lng": 25.7333,
    "region": "Тернопільська"
  },
  "Кременец": {
    "lat": 50.1,
    "lng": 25.7333,
    "region": "Тернопільська"
  },
  "Бережани": {
    "lat": 49.45,
    "lng": 24.9333,
    "region": "Тернопільська"
  },
  "Збараж": {
    "lat": 49.6667,
    "lng": 25.7667,
    "region": "Тернопільська"
  },
  "Теребовля": {
    "lat": 49.3,
    "lng": 25.7167,
    "region": "Тернопільська"
  },
  "Бучач": {
    "lat": 49.0667,
    "lng": 25.4,
    "region": "Тернопільська"
  },
  "Заліщики": {
    "lat": 48.65,
    "lng": 25.7333,
    "region": "Тернопільська"
  },
  "Залещики": {
    "lat": 48.65,
    "lng": 25.7333,
    "region": "Тернопільська"
  },
  "Почаїв": {
    "lat": 50,
    "lng": 25.5,
    "region": "Тернопільська"
  },
  "Почаев": {
    "lat": 50,
    "lng": 25.5,
    "region": "Тернопільська"
  },
  "Новодністровськ": {
    "lat": 48.5833,
    "lng": 27.4333,
    "region": "Чернівецька"
  },
  "Сокиряни": {
    "lat": 48.45,
    "lng": 27.4167,
    "region": "Чернівецька"
  },
  "Заставна": {
    "lat": 48.5167,
    "lng": 25.85,
    "region": "Чернівецька"
  },
  "Вижниця": {
    "lat": 48.25,
    "lng": 25.1833,
    "region": "Чернівецька"
  },
  "Нежин": {
    "lat": 51.05,
    "lng": 31.8833,
    "region": "Чернігівська"
  },
  "Носівка": {
    "lat": 50.9333,
    "lng": 31.5833,
    "region": "Чернігівська"
  },
  "Новгород-Сіверський": {
    "lat": 52,
    "lng": 33.2667,
    "region": "Чернігівська"
  },
  "Мена": {
    "lat": 51.5167,
    "lng": 32.2167,
    "region": "Чернігівська"
  },
  "Сновськ": {
    "lat": 51.8167,
    "lng": 31.95,
    "region": "Чернігівська"
  },
  "Щорс": {
    "lat": 51.8167,
    "lng": 31.95,
    "region": "Чернігівська"
  },
  "Ічня": {
    "lat": 50.85,
    "lng": 32.3833,
    "region": "Чернігівська"
  },
  "Бобровиця": {
    "lat": 50.75,
    "lng": 31.3833,
    "region": "Чернігівська"
  },
  "Остер": {
    "lat": 50.95,
    "lng": 30.8833,
    "region": "Чернігівська"
  },
  "Шостка": {
    "lat": 51.8667,
    "lng": 33.4833,
    "region": "Сумська"
  },
  "Ахтырка": {
    "lat": 50.3167,
    "lng": 34.9,
    "region": "Сумська"
  },
  "Ромны": {
    "lat": 50.75,
    "lng": 33.4833,
    "region": "Сумська"
  },
  "Глухов": {
    "lat": 51.6833,
    "lng": 33.9167,
    "region": "Сумська"
  },
  "Лебедин": {
    "lat": 50.5833,
    "lng": 34.4833,
    "region": "Сумська"
  },
  "Кролевець": {
    "lat": 51.55,
    "lng": 33.3833,
    "region": "Сумська"
  },
  "Тростянец": {
    "lat": 50.4833,
    "lng": 34.9667,
    "region": "Сумська"
  },
  "Білопілля": {
    "lat": 51.15,
    "lng": 34.3,
    "region": "Сумська"
  },
  "Александрия": {
    "lat": 48.6667,
    "lng": 33.1167,
    "region": "Кіровоградська"
  },
  "Світловодськ": {
    "lat": 49.05,
    "lng": 33.2333,
    "region": "Кіровоградська"
  },
  "Светловодск": {
    "lat": 49.05,
    "lng": 33.2333,
    "region": "Кіровоградська"
  },
  "Знам'янка": {
    "lat": 48.7167,
    "lng": 32.6667,
    "region": "Кіровоградська"
  },
  "Знаменка": {
    "lat": 48.7167,
    "lng": 32.6667,
    "region": "Кіровоградська"
  },
  "Долинська": {
    "lat": 48.1167,
    "lng": 32.7667,
    "region": "Кіровоградська"
  },
  "Гайворон": {
    "lat": 48.3333,
    "lng": 29.8667,
    "region": "Кіровоградська"
  },
  "Новомиргород": {
    "lat": 48.8,
    "lng": 31.65,
    "region": "Кіровоградська"
  },
  "Мала Виска": {
    "lat": 48.65,
    "lng": 31.6333,
    "region": "Кіровоградська"
  },
  "Бобринець": {
    "lat": 48.0667,
    "lng": 32.1667,
    "region": "Кіровоградська"
  },
  "Помічна": {
    "lat": 48.25,
    "lng": 31.4167,
    "region": "Кіровоградська"
  },
  "Благовіщенське": {
    "lat": 48.3333,
    "lng": 30.2333,
    "region": "Кіровоградська"
  },
  "Бердянськ": {
    "lat": 46.7583,
    "lng": 36.7889,
    "region": "Запорізька"
  },
  "Бердянск": {
    "lat": 46.7583,
    "lng": 36.7889,
    "region": "Запорізька"
  },
  "Мелітополь": {
    "lat": 46.8489,
    "lng": 35.3694,
    "region": "Запорізька"
  },
  "Мелитополь": {
    "lat": 46.8489,
    "lng": 35.3694,
    "region": "Запорізька"
  },
  "Енергодар": {
    "lat": 47.4989,
    "lng": 34.6567,
    "region": "Запорізька"
  },
  "Энергодар": {
    "lat": 47.4989,
    "lng": 34.6567,
    "region": "Запорізька"
  },
  "Токмак": {
    "lat": 47.25,
    "lng": 35.7,
    "region": "Запорізька"
  },
  "Пологи": {
    "lat": 47.4833,
    "lng": 36.2667,
    "region": "Запорізька"
  },
  "Дніпрорудне": {
    "lat": 47.3833,
    "lng": 34.9833,
    "region": "Запорізька"
  },
  "Оріхів": {
    "lat": 47.5667,
    "lng": 35.7833,
    "region": "Запорізька"
  },
  "Гуляйполе": {
    "lat": 47.6667,
    "lng": 36.2667,
    "region": "Запорізька"
  },
  "Василівка": {
    "lat": 47.4333,
    "lng": 35.2667,
    "region": "Запорізька"
  },
  "Приморськ": {
    "lat": 46.7333,
    "lng": 36.35,
    "region": "Запорізька"
  },
  "Сонячне": {
    "lat": 47.8833,
    "lng": 35.05,
    "region": "Запорізька"
  },
  "Володимирівське": {
    "lat": 47.9167,
    "lng": 35.0667,
    "region": "Запорізька"
  },
  "Владимировское": {
    "lat": 47.9167,
    "lng": 35.0667,
    "region": "Запорізька"
  },
  "Нова Каховка": {
    "lat": 46.75,
    "lng": 33.3667,
    "region": "Херсонська"
  },
  "Каховка": {
    "lat": 46.8167,
    "lng": 33.4833,
    "region": "Херсонська"
  },
  "Олешки": {
    "lat": 46.6167,
    "lng": 32.7167,
    "region": "Херсонська"
  },
  "Цюрупинськ": {
    "lat": 46.6167,
    "lng": 32.7167,
    "region": "Херсонська"
  },
  "Скадовськ": {
    "lat": 46.1167,
    "lng": 32.9167,
    "region": "Херсонська"
  },
  "Генічеськ": {
    "lat": 46.1667,
    "lng": 34.8,
    "region": "Херсонська"
  },
  "Берислав": {
    "lat": 46.8333,
    "lng": 33.4167,
    "region": "Херсонська"
  },
  "Таврійськ": {
    "lat": 46.75,
    "lng": 33.4167,
    "region": "Херсонська"
  },
  "Гола Пристань": {
    "lat": 46.5167,
    "lng": 32.5167,
    "region": "Херсонська"
  }
};
